use crate::{globals::emacs_globals, sys::Lisp_Object};

use libc::timespec;
/* automatically generated by rust-bindgen */

#[repr(C)]
#[derive(Copy, Clone, Debug, Default, Eq, Hash, Ord, PartialEq, PartialOrd)]
pub struct __BindgenBitfieldUnit<Storage, Align>
where
    Storage: AsRef<[u8]> + AsMut<[u8]>,
{
    storage: Storage,
    align: [Align; 0],
}
impl<Storage, Align> __BindgenBitfieldUnit<Storage, Align>
where
    Storage: AsRef<[u8]> + AsMut<[u8]>,
{
    #[inline]
    pub fn new(storage: Storage) -> Self {
        Self { storage, align: [] }
    }
    #[inline]
    pub fn get_bit(&self, index: usize) -> bool {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = self.storage.as_ref()[byte_index];
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        byte & mask == mask
    }
    #[inline]
    pub fn set_bit(&mut self, index: usize, val: bool) {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = &mut self.storage.as_mut()[byte_index];
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        if val {
            *byte |= mask;
        } else {
            *byte &= !mask;
        }
    }

pub const B300: u32 = 7;
pub const B600: u32 = 8;
pub const B1200: u32 = 9;
pub const B1800: u32 = 10;
pub const B2400: u32 = 11;
pub const B4800: u32 = 12;
pub const B9600: u32 = 13;
pub const B19200: u32 = 14;
pub const B38400: u32 = 15;
pub const EXTA: u32 = 14;
pub const EXTB: u32 = 15;
pub const CBAUD: u32 = 4111;
pub const CBAUDEX: u32 = 4096;
pub const CIBAUD: u32 = 269418496;
pub const CMSPAR: u32 = 1073741824;
pub const CRTSCTS: u32 = 2147483648;
pub const B57600: u32 = 4097;
pub const B115200: u32 = 4098;
pub const B230400: u32 = 4099;
pub const B460800: u32 = 4100;
pub const B500000: u32 = 4101;
pub const B576000: u32 = 4102;
pub const B921600: u32 = 4103;
pub const B1000000: u32 = 4104;
pub const B1152000: u32 = 4105;
pub const B1500000: u32 = 4106;
pub const B2000000: u32 = 4107;
pub const B2500000: u32 = 4108;
pub const B3000000: u32 = 4109;
pub const B3500000: u32 = 4110;
pub const B4000000: u32 = 4111;
pub const __MAX_BAUD: u32 = 4111;
pub const CSIZE: u32 = 48;
pub const CS5: u32 = 0;
pub const CS6: u32 = 16;
pub const CS7: u32 = 32;
pub const CS8: u32 = 48;
pub const CSTOPB: u32 = 64;
pub const CREAD: u32 = 128;
pub const PARENB: u32 = 256;
pub const PARODD: u32 = 512;
pub const HUPCL: u32 = 1024;
pub const CLOCAL: u32 = 2048;
pub const ISIG: u32 = 1;
pub const ICANON: u32 = 2;
pub const XCASE: u32 = 4;
pub const ECHO: u32 = 8;
pub const ECHOE: u32 = 16;
pub const ECHOK: u32 = 32;
pub const ECHONL: u32 = 64;
pub const NOFLSH: u32 = 128;
pub const TOSTOP: u32 = 256;
pub const ECHOCTL: u32 = 512;
pub const ECHOPRT: u32 = 1024;
pub const ECHOKE: u32 = 2048;
pub const FLUSHO: u32 = 4096;
pub const PENDIN: u32 = 16384;
pub const IEXTEN: u32 = 32768;
pub const EXTPROC: u32 = 65536;
pub const TCOOFF: u32 = 0;
pub const TCOON: u32 = 1;
pub const TCIOFF: u32 = 2;
pub const TCION: u32 = 3;
pub const TCIFLUSH: u32 = 0;
pub const TCOFLUSH: u32 = 1;
pub const TCIOFLUSH: u32 = 2;
pub const TCSANOW: u32 = 0;
pub const TCSADRAIN: u32 = 1;
pub const TCSAFLUSH: u32 = 2;
pub const CDISABLE: u8 = 0u8;
pub const _SYS_WAIT_H: u32 = 1;
pub const WNOHANG: u32 = 1;
pub const WUNTRACED: u32 = 2;
pub const WSTOPPED: u32 = 2;
pub const WEXITED: u32 = 4;
pub const WCONTINUED: u32 = 8;
pub const WNOWAIT: u32 = 16777216;
pub const __WNOTHREAD: u32 = 536870912;
pub const __WALL: u32 = 1073741824;
pub const __WCLONE: u32 = 2147483648;
pub const __W_CONTINUED: u32 = 65535;
pub const __WCOREFLAG: u32 = 128;
pub const WCOREFLAG: u32 = 128;
pub const WAIT_ANY: i32 = -1;
pub const WAIT_MYPGRP: u32 = 0;
pub type bool_bf = bool;
extern "C" {
    pub fn emacs_getenv_TZ() -> *mut ::libc::c_char;
}
extern "C" {
    pub fn emacs_setenv_TZ(arg1: *const ::libc::c_char) -> ::libc::c_int;
}
pub type __jmp_buf = [::libc::c_long; 8usize];
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct __sigset_t {
    pub __val: [::libc::c_ulong; 16usize],
}
#[test]
fn bindgen_test_layout___sigset_t() {
    assert_eq!(
        ::std::mem::size_of::<__sigset_t>(),
        128usize,
        concat!("Size of: ", stringify!(__sigset_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__sigset_t>(),
        8usize,
        concat!("Alignment of ", stringify!(__sigset_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__sigset_t>())).__val as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__sigset_t),
            "::",
            stringify!(__val)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct __jmp_buf_tag {
    pub __jmpbuf: __jmp_buf,
    pub __mask_was_saved: ::libc::c_int,
    pub __saved_mask: __sigset_t,
}
#[test]
fn bindgen_test_layout___jmp_buf_tag() {
    assert_eq!(
        ::std::mem::size_of::<__jmp_buf_tag>(),
        200usize,
        concat!("Size of: ", stringify!(__jmp_buf_tag))
    );
    assert_eq!(
        ::std::mem::align_of::<__jmp_buf_tag>(),
        8usize,
        concat!("Alignment of ", stringify!(__jmp_buf_tag))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__jmp_buf_tag>())).__jmpbuf as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__jmp_buf_tag),
            "::",
            stringify!(__jmpbuf)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__jmp_buf_tag>())).__mask_was_saved as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(__jmp_buf_tag),
            "::",
            stringify!(__mask_was_saved)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__jmp_buf_tag>())).__saved_mask as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(__jmp_buf_tag),
            "::",
            stringify!(__saved_mask)
        )
    );
}
pub type jmp_buf = [__jmp_buf_tag; 1usize];
extern "C" {
    pub fn setjmp(__env: *mut __jmp_buf_tag) -> ::libc::c_int;
}
extern "C" {
    pub fn __sigsetjmp(__env: *mut __jmp_buf_tag, __savemask: ::libc::c_int) -> ::libc::c_int;
}
extern "C" {
    pub fn _setjmp(__env: *mut __jmp_buf_tag) -> ::libc::c_int;
}
extern "C" {
    pub fn longjmp(__env: *mut __jmp_buf_tag, __val: ::libc::c_int);
}
extern "C" {
    pub fn _longjmp(__env: *mut __jmp_buf_tag, __val: ::libc::c_int);
}
pub type sigjmp_buf = [__jmp_buf_tag; 1usize];
extern "C" {
    pub fn siglongjmp(__env: *mut __jmp_buf_tag, __val: ::libc::c_int);
}
pub type va_list = __builtin_va_list;
pub type __gnuc_va_list = __builtin_va_list;
pub type wchar_t = ::libc::c_int;
#[repr(C)]
#[repr(align(16))]
#[derive(Debug, Default, Copy, Clone)]
pub struct max_align_t {
    pub __clang_max_align_nonce1: ::libc::c_longlong,
    pub __bindgen_padding_0: u64,
    pub __clang_max_align_nonce2: u128,
}
#[test]
fn bindgen_test_layout_max_align_t() {
    assert_eq!(
        ::std::mem::size_of::<max_align_t>(),
        32usize,
        concat!("Size of: ", stringify!(max_align_t))
    );
    assert_eq!(
        ::std::mem::align_of::<max_align_t>(),
        16usize,
        concat!("Alignment of ", stringify!(max_align_t))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<max_align_t>())).__clang_max_align_nonce1 as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(max_align_t),
            "::",
            stringify!(__clang_max_align_nonce1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<max_align_t>())).__clang_max_align_nonce2 as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(max_align_t),
            "::",
            stringify!(__clang_max_align_nonce2)
        )
    );
}
extern "C" {
    pub fn memcpy(
        __dest: *mut ::libc::c_void,
        __src: *const ::libc::c_void,
        __n: usize,
    ) -> *mut ::libc::c_void;
}
extern "C" {
    pub fn memmove(
        __dest: *mut ::libc::c_void,
        __src: *const ::libc::c_void,
        __n: usize,
    ) -> *mut ::libc::c_void;
}
extern "C" {
    pub fn memccpy(
        __dest: *mut ::libc::c_void,
        __src: *const ::libc::c_void,
        __c: ::libc::c_int,
        __n: usize,
    ) -> *mut ::libc::c_void;
}
extern "C" {
    pub fn memset(__s: *mut ::libc::c_void, __c: ::libc::c_int, __n: usize) -> *mut ::libc::c_void;
}
extern "C" {
    pub fn memcmp(
        __s1: *const ::libc::c_void,
        __s2: *const ::libc::c_void,
        __n: usize,
    ) -> ::libc::c_int;
}
extern "C" {
    pub fn memchr(
        __s: *const ::libc::c_void,
        __c: ::libc::c_int,
        __n: usize,
    ) -> *mut ::libc::c_void;
}
extern "C" {
    pub fn rawmemchr(__s: *const ::libc::c_void, __c: ::libc::c_int) -> *mut ::libc::c_void;
}
extern "C" {
    pub fn memrchr(
        __s: *const ::libc::c_void,
        __c: ::libc::c_int,
        __n: usize,
    ) -> *mut ::libc::c_void;
}
extern "C" {
    pub fn strcpy(__dest: *mut ::libc::c_char, __src: *const ::libc::c_char)
        -> *mut ::libc::c_char;
}
extern "C" {
    pub fn strncpy(
        __dest: *mut ::libc::c_char,
        __src: *const ::libc::c_char,
        __n: usize,
    ) -> *mut ::libc::c_char;
}
extern "C" {
    pub fn strcat(__dest: *mut ::libc::c_char, __src: *const ::libc::c_char)
        -> *mut ::libc::c_char;
}
extern "C" {
    pub fn strncat(
        __dest: *mut ::libc::c_char,
        __src: *const ::libc::c_char,
        __n: usize,
    ) -> *mut ::libc::c_char;
}
extern "C" {
    pub fn strcmp(__s1: *const ::libc::c_char, __s2: *const ::libc::c_char) -> ::libc::c_int;
}
extern "C" {
    pub fn strncmp(
        __s1: *const ::libc::c_char,
        __s2: *const ::libc::c_char,
        __n: usize,
    ) -> ::libc::c_int;
}
extern "C" {
    pub fn strcoll(__s1: *const ::libc::c_char, __s2: *const ::libc::c_char) -> ::libc::c_int;
}
extern "C" {
    pub fn strxfrm(
        __dest: *mut ::libc::c_char,
        __src: *const ::libc::c_char,
        __n: usize,
    ) -> ::libc::c_ulong;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __locale_struct {
    pub __locales: [*mut __locale_data; 13usize],
    pub __ctype_b: *const ::libc::c_ushort,
    pub __ctype_tolower: *const ::libc::c_int,
    pub __ctype_toupper: *const ::libc::c_int,
    pub __names: [*const ::libc::c_char; 13usize],
}
#[test]
fn bindgen_test_layout___locale_struct() {
    assert_eq!(
        ::std::mem::size_of::<__locale_struct>(),
        232usize,
        concat!("Size of: ", stringify!(__locale_struct))
    );
    assert_eq!(
        ::std::mem::align_of::<__locale_struct>(),
        8usize,
        concat!("Alignment of ", stringify!(__locale_struct))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__locale_struct>())).__locales as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__locale_struct),
            "::",
            stringify!(__locales)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__locale_struct>())).__ctype_b as *const _ as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(__locale_struct),
            "::",
            stringify!(__ctype_b)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__locale_struct>())).__ctype_tolower as *const _ as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(__locale_struct),
            "::",
            stringify!(__ctype_tolower)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__locale_struct>())).__ctype_toupper as *const _ as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(__locale_struct),
            "::",
            stringify!(__ctype_toupper)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__locale_struct>())).__names as *const _ as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(__locale_struct),
            "::",
            stringify!(__names)
        )
    );
}
impl Default for __locale_struct {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
pub type __locale_t = *mut __locale_struct;
pub type locale_t = __locale_t;
extern "C" {
    pub fn strcoll_l(
        __s1: *const ::libc::c_char,
        __s2: *const ::libc::c_char,
        __l: locale_t,
    ) -> ::libc::c_int;
}
extern "C" {
    pub fn strxfrm_l(
        __dest: *mut ::libc::c_char,
        __src: *const ::libc::c_char,
        __n: usize,
        __l: locale_t,
    ) -> usize;
}
extern "C" {
    pub fn strdup(__s: *const ::libc::c_char) -> *mut ::libc::c_char;
}
extern "C" {
    pub fn strndup(__string: *const ::libc::c_char, __n: usize) -> *mut ::libc::c_char;
}
extern "C" {
    pub fn strchr(__s: *const ::libc::c_char, __c: ::libc::c_int) -> *mut ::libc::c_char;
}
extern "C" {
    pub fn strrchr(__s: *const ::libc::c_char, __c: ::libc::c_int) -> *mut ::libc::c_char;
}
extern "C" {
    pub fn strchrnul(__s: *const ::libc::c_char, __c: ::libc::c_int) -> *mut ::libc::c_char;
}
extern "C" {
    pub fn strcspn(__s: *const ::libc::c_char, __reject: *const ::libc::c_char) -> ::libc::c_ulong;
}
extern "C" {
    pub fn strspn(__s: *const ::libc::c_char, __accept: *const ::libc::c_char) -> ::libc::c_ulong;
}
extern "C" {
    pub fn strpbrk(
        __s: *const ::libc::c_char,
        __accept: *const ::libc::c_char,
    ) -> *mut ::libc::c_char;
}
extern "C" {
    pub fn strstr(
        __haystack: *const ::libc::c_char,
        __needle: *const ::libc::c_char,
    ) -> *mut ::libc::c_char;
}
extern "C" {
    pub fn strtok(__s: *mut ::libc::c_char, __delim: *const ::libc::c_char) -> *mut ::libc::c_char;
}
extern "C" {
    pub fn __strtok_r(
        __s: *mut ::libc::c_char,
        __delim: *const ::libc::c_char,
        __save_ptr: *mut *mut ::libc::c_char,
    ) -> *mut ::libc::c_char;
}
extern "C" {
    pub fn strtok_r(
        __s: *mut ::libc::c_char,
        __delim: *const ::libc::c_char,
        __save_ptr: *mut *mut ::libc::c_char,
    ) -> *mut ::libc::c_char;
}
extern "C" {
    pub fn strcasestr(
        __haystack: *const ::libc::c_char,
        __needle: *const ::libc::c_char,
    ) -> *mut ::libc::c_char;
}
extern "C" {
    pub fn memmem(
        __haystack: *const ::libc::c_void,
        __haystacklen: usize,
        __needle: *const ::libc::c_void,
        __needlelen: usize,
    ) -> *mut ::libc::c_void;
}
extern "C" {
    pub fn __mempcpy(
        __dest: *mut ::libc::c_void,
        __src: *const ::libc::c_void,
        __n: usize,
    ) -> *mut ::libc::c_void;
}
extern "C" {
    pub fn mempcpy(
        __dest: *mut ::libc::c_void,
        __src: *const ::libc::c_void,
        __n: usize,
    ) -> *mut ::libc::c_void;
}
extern "C" {
    pub fn strlen(__s: *const ::libc::c_char) -> ::libc::c_ulong;
}
extern "C" {
    pub fn strnlen(__string: *const ::libc::c_char, __maxlen: usize) -> usize;
}
extern "C" {
    pub fn strerror(__errnum: ::libc::c_int) -> *mut ::libc::c_char;
}
extern "C" {
    pub fn strerror_r(
        __errnum: ::libc::c_int,
        __buf: *mut ::libc::c_char,
        __buflen: usize,
    ) -> *mut ::libc::c_char;
}
extern "C" {
    pub fn strerrordesc_np(__err: ::libc::c_int) -> *const ::libc::c_char;
}
extern "C" {
    pub fn strerrorname_np(__err: ::libc::c_int) -> *const ::libc::c_char;
}
extern "C" {
    pub fn strerror_l(__errnum: ::libc::c_int, __l: locale_t) -> *mut ::libc::c_char;
}
extern "C" {
    pub fn bcmp(
        __s1: *const ::libc::c_void,
        __s2: *const ::libc::c_void,
        __n: usize,
    ) -> ::libc::c_int;
}
extern "C" {
    pub fn bcopy(__src: *const ::libc::c_void, __dest: *mut ::libc::c_void, __n: usize);
}
extern "C" {
    pub fn bzero(__s: *mut ::libc::c_void, __n: usize);
}
extern "C" {
    pub fn index(__s: *const ::libc::c_char, __c: ::libc::c_int) -> *mut ::libc::c_char;
}
extern "C" {
    pub fn rindex(__s: *const ::libc::c_char, __c: ::libc::c_int) -> *mut ::libc::c_char;
}
extern "C" {
    pub fn ffs(__i: ::libc::c_int) -> ::libc::c_int;
}
extern "C" {
    pub fn ffsl(__l: ::libc::c_long) -> ::libc::c_int;
}
extern "C" {
    pub fn ffsll(__ll: ::libc::c_longlong) -> ::libc::c_int;
}
extern "C" {
    pub fn strcasecmp(__s1: *const ::libc::c_char, __s2: *const ::libc::c_char) -> ::libc::c_int;
}
extern "C" {
    pub fn strncasecmp(
        __s1: *const ::libc::c_char,
        __s2: *const ::libc::c_char,
        __n: usize,
    ) -> ::libc::c_int;
}
extern "C" {
    pub fn strcasecmp_l(
        __s1: *const ::libc::c_char,
        __s2: *const ::libc::c_char,
        __loc: locale_t,
    ) -> ::libc::c_int;
}
extern "C" {
    pub fn strncasecmp_l(
        __s1: *const ::libc::c_char,
        __s2: *const ::libc::c_char,
        __n: usize,
        __loc: locale_t,
    ) -> ::libc::c_int;
}
extern "C" {
    pub fn explicit_bzero(__s: *mut ::libc::c_void, __n: usize);
}
extern "C" {
    pub fn strsep(
        __stringp: *mut *mut ::libc::c_char,
        __delim: *const ::libc::c_char,
    ) -> *mut ::libc::c_char;
}
extern "C" {
    pub fn strsignal(__sig: ::libc::c_int) -> *mut ::libc::c_char;
}
extern "C" {
    pub fn sigabbrev_np(__sig: ::libc::c_int) -> *const ::libc::c_char;
}
extern "C" {
    pub fn sigdescr_np(__sig: ::libc::c_int) -> *const ::libc::c_char;
}
extern "C" {
    pub fn __stpcpy(
        __dest: *mut ::libc::c_char,
        __src: *const ::libc::c_char,
    ) -> *mut ::libc::c_char;
}
extern "C" {
    pub fn stpcpy(__dest: *mut ::libc::c_char, __src: *const ::libc::c_char)
        -> *mut ::libc::c_char;
}
extern "C" {
    pub fn __stpncpy(
        __dest: *mut ::libc::c_char,
        __src: *const ::libc::c_char,
        __n: usize,
    ) -> *mut ::libc::c_char;
}
extern "C" {
    pub fn stpncpy(
        __dest: *mut ::libc::c_char,
        __src: *const ::libc::c_char,
        __n: usize,
    ) -> *mut ::libc::c_char;
}
extern "C" {
    pub fn strverscmp(__s1: *const ::libc::c_char, __s2: *const ::libc::c_char) -> ::libc::c_int;
}
extern "C" {
    pub fn strfry(__string: *mut ::libc::c_char) -> *mut ::libc::c_char;
}
extern "C" {
    pub fn memfrob(__s: *mut ::libc::c_void, __n: usize) -> *mut ::libc::c_void;
}
extern "C" {
    pub fn basename(__filename: *const ::libc::c_char) -> *mut ::libc::c_char;
}
extern "C" {
    #[link_name = "\u{1}_gl_cxxalias_dummy"]
    pub static mut _gl_cxxalias_dummy: ::libc::c_int;
}
pub type __u_char = ::libc::c_uchar;
pub type __u_short = ::libc::c_ushort;
pub type __u_int = ::libc::c_uint;
pub type __u_long = ::libc::c_ulong;
pub type __int8_t = ::libc::c_schar;
pub type __uint8_t = ::libc::c_uchar;
pub type __int16_t = ::libc::c_short;
pub type __uint16_t = ::libc::c_ushort;
pub type __int32_t = ::libc::c_int;
pub type __uint32_t = ::libc::c_uint;
pub type __int64_t = ::libc::c_long;
pub type __uint64_t = ::libc::c_ulong;
pub type __int_least8_t = __int8_t;
pub type __uint_least8_t = __uint8_t;
pub type __int_least16_t = __int16_t;
pub type __uint_least16_t = __uint16_t;
pub type __int_least32_t = __int32_t;
pub type __uint_least32_t = __uint32_t;
pub type __int_least64_t = __int64_t;
pub type __uint_least64_t = __uint64_t;
pub type __quad_t = ::libc::c_long;
pub type __u_quad_t = ::libc::c_ulong;
pub type __intmax_t = ::libc::c_long;
pub type __uintmax_t = ::libc::c_ulong;
pub type __dev_t = ::libc::c_ulong;
pub type __uid_t = ::libc::c_uint;
pub type __gid_t = ::libc::c_uint;
pub type __ino_t = ::libc::c_ulong;
pub type __ino64_t = ::libc::c_ulong;
pub type __mode_t = ::libc::c_uint;
pub type __nlink_t = ::libc::c_ulong;
pub type __off_t = ::libc::c_long;
pub type __off64_t = ::libc::c_long;
pub type __pid_t = ::libc::c_int;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct __fsid_t {
    pub __val: [::libc::c_int; 2usize],
}
#[test]
fn bindgen_test_layout___fsid_t() {
    assert_eq!(
        ::std::mem::size_of::<__fsid_t>(),
        8usize,
        concat!("Size of: ", stringify!(__fsid_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__fsid_t>(),
        4usize,
        concat!("Alignment of ", stringify!(__fsid_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__fsid_t>())).__val as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__fsid_t),
            "::",
            stringify!(__val)
        )
    );
}
pub type __clock_t = ::libc::c_long;
pub type __rlim_t = ::libc::c_ulong;
pub type __rlim64_t = ::libc::c_ulong;
pub type __id_t = ::libc::c_uint;
pub type __time_t = ::libc::c_long;
pub type __useconds_t = ::libc::c_uint;
pub type __suseconds_t = ::libc::c_long;
pub type __suseconds64_t = ::libc::c_long;
pub type __daddr_t = ::libc::c_int;
pub type __key_t = ::libc::c_int;
pub type __clockid_t = ::libc::c_int;
pub type __timer_t = *mut ::libc::c_void;
pub type __blksize_t = ::libc::c_long;
pub type __blkcnt_t = ::libc::c_long;
pub type __blkcnt64_t = ::libc::c_long;
pub type __fsblkcnt_t = ::libc::c_ulong;
pub type __fsblkcnt64_t = ::libc::c_ulong;
pub type __fsfilcnt_t = ::libc::c_ulong;
pub type __fsfilcnt64_t = ::libc::c_ulong;
pub type __fsword_t = ::libc::c_long;
pub type __ssize_t = ::libc::c_long;
pub type __syscall_slong_t = ::libc::c_long;
pub type __syscall_ulong_t = ::libc::c_ulong;
pub type __loff_t = __off64_t;
pub type __caddr_t = *mut ::libc::c_char;
pub type __intptr_t = ::libc::c_long;
pub type __socklen_t = ::libc::c_uint;
pub type __sig_atomic_t = ::libc::c_int;
pub type int_least8_t = __int_least8_t;
pub type int_least16_t = __int_least16_t;
pub type int_least32_t = __int_least32_t;
pub type int_least64_t = __int_least64_t;
pub type uint_least8_t = __uint_least8_t;
pub type uint_least16_t = __uint_least16_t;
pub type uint_least32_t = __uint_least32_t;
pub type uint_least64_t = __uint_least64_t;
pub type int_fast8_t = ::libc::c_schar;
pub type int_fast16_t = ::libc::c_long;
pub type int_fast32_t = ::libc::c_long;
pub type int_fast64_t = ::libc::c_long;
pub type uint_fast8_t = ::libc::c_uchar;
pub type uint_fast16_t = ::libc::c_ulong;
pub type uint_fast32_t = ::libc::c_ulong;
pub type uint_fast64_t = ::libc::c_ulong;
pub type intmax_t = __intmax_t;
pub type uintmax_t = __uintmax_t;
pub type __gwchar_t = ::libc::c_int;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct imaxdiv_t {
    pub quot: ::libc::c_long,
    pub rem: ::libc::c_long,
}
#[test]
fn bindgen_test_layout_imaxdiv_t() {
    assert_eq!(
        ::std::mem::size_of::<imaxdiv_t>(),
        16usize,
        concat!("Size of: ", stringify!(imaxdiv_t))
    );
    assert_eq!(
        ::std::mem::align_of::<imaxdiv_t>(),
        8usize,
        concat!("Alignment of ", stringify!(imaxdiv_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<imaxdiv_t>())).quot as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(imaxdiv_t),
            "::",
            stringify!(quot)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<imaxdiv_t>())).rem as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(imaxdiv_t),
            "::",
            stringify!(rem)
        )
    );
}
extern "C" {
    pub fn imaxabs(__n: intmax_t) -> intmax_t;
}
extern "C" {
    pub fn imaxdiv(__numer: intmax_t, __denom: intmax_t) -> imaxdiv_t;
}
extern "C" {
    pub fn strtoimax(
        __nptr: *const ::libc::c_char,
        __endptr: *mut *mut ::libc::c_char,
        __base: ::libc::c_int,
    ) -> intmax_t;
}
extern "C" {
    pub fn strtoumax(
        __nptr: *const ::libc::c_char,
        __endptr: *mut *mut ::libc::c_char,
        __base: ::libc::c_int,
    ) -> uintmax_t;
}
extern "C" {
    pub fn wcstoimax(
        __nptr: *const __gwchar_t,
        __endptr: *mut *mut __gwchar_t,
        __base: ::libc::c_int,
    ) -> intmax_t;
}
extern "C" {
    pub fn wcstoumax(
        __nptr: *const __gwchar_t,
        __endptr: *mut *mut __gwchar_t,
        __base: ::libc::c_int,
    ) -> uintmax_t;
}
pub type EMACS_INT = ::libc::c_long;
pub type EMACS_UINT = ::libc::c_ulong;
pub const EMACS_INT_WIDTH: _bindgen_ty_1 = 64;
pub const EMACS_UINT_WIDTH: _bindgen_ty_1 = 64;
pub type _bindgen_ty_1 = u32;
pub const BOOL_VECTOR_BITS_PER_CHAR: _bindgen_ty_2 = 8;
pub type _bindgen_ty_2 = u32;
pub type bits_word = usize;
pub const BITS_PER_BITS_WORD: _bindgen_ty_3 = 64;
pub type _bindgen_ty_3 = u32;
pub mod Lisp_Bits {
    #[doc = " Select the tagging scheme."]
    pub type Type = u32;
    pub const VALBITS: Type = 61;
    pub const FIXNUM_BITS: Type = 62;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Lisp_X {
    _unused: [u8; 0],
}
pub type Lisp_Word = *mut Lisp_X;
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum Lisp_Type {
    Lisp_Symbol = 0,
    Lisp_Type_Unused0 = 1,
    Lisp_Int0 = 2,
    Lisp_Int1 = 6,
    Lisp_String = 4,
    Lisp_Vectorlike = 5,
    Lisp_Cons = 3,
    Lisp_Float = 7,
}
pub mod Lisp_Fwd_Type {
    pub type Type = u32;
    pub const Lisp_Fwd_Int: Type = 0;
    pub const Lisp_Fwd_Bool: Type = 1;
    pub const Lisp_Fwd_Obj: Type = 2;
    pub const Lisp_Fwd_Buffer_Obj: Type = 3;
    pub const Lisp_Fwd_Kboard_Obj: Type = 4;
}
pub mod CHECK_LISP_OBJECT_TYPE {
    pub type Type = u32;
    pub const CHECK_LISP_OBJECT_TYPE: Type = 0;
}
extern "C" {
    pub fn set_sub_char_table_contents(arg1: Lisp_Object, arg2: isize, arg3: Lisp_Object);
}
extern "C" {
    pub fn check_int_nonnegative(arg1: Lisp_Object) -> ::libc::c_int;
}
extern "C" {
    pub fn check_integer_range(arg1: Lisp_Object, arg2: intmax_t, arg3: intmax_t) -> intmax_t;
}
extern "C" {
    pub fn bignum_to_double(arg1: Lisp_Object) -> f64;
}
extern "C" {
    pub fn make_bigint(arg1: intmax_t) -> Lisp_Object;
}
extern "C" {
    pub fn make_biguint(arg1: uintmax_t) -> Lisp_Object;
}
extern "C" {
    pub fn check_uinteger_max(arg1: Lisp_Object, arg2: uintmax_t) -> uintmax_t;
}
extern "C" {
    pub fn char_table_ref(arg1: Lisp_Object, arg2: ::libc::c_int) -> Lisp_Object;
}
extern "C" {
    pub fn char_table_set(arg1: Lisp_Object, arg2: ::libc::c_int, arg3: Lisp_Object);
}
extern "C" {
    pub fn args_out_of_range_3(arg1: Lisp_Object, arg2: Lisp_Object, arg3: Lisp_Object);
}
extern "C" {
    pub fn default_value(symbol: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    #[link_name = "\u{1}initialized"]
    pub static mut initialized: bool;
}
#[repr(C, packed)]
#[derive(Debug, Default, Copy, Clone)]
pub struct gflags {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize], u8>,
}
#[test]
fn bindgen_test_layout_gflags() {
    assert_eq!(
        ::std::mem::size_of::<gflags>(),
        1usize,
        concat!("Size of: ", stringify!(gflags))
    );
    assert_eq!(
        ::std::mem::align_of::<gflags>(),
        1usize,
        concat!("Alignment of ", stringify!(gflags))
    );
}
impl gflags {
    #[inline]
    pub fn will_dump_(&self) -> bool {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_will_dump_(&mut self, val: bool) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn will_bootstrap_(&self) -> bool {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_will_bootstrap_(&mut self, val: bool) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn will_dump_with_pdumper_(&self) -> bool {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_will_dump_with_pdumper_(&mut self, val: bool) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn dumped_with_pdumper_(&self) -> bool {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_dumped_with_pdumper_(&mut self, val: bool) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        will_dump_: bool,
        will_bootstrap_: bool,
        will_dump_with_pdumper_: bool,
        dumped_with_pdumper_: bool,
    ) -> __BindgenBitfieldUnit<[u8; 1usize], u8> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize], u8> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let will_dump_: u8 = unsafe { ::std::mem::transmute(will_dump_) };
            will_dump_ as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let will_bootstrap_: u8 = unsafe { ::std::mem::transmute(will_bootstrap_) };
            will_bootstrap_ as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let will_dump_with_pdumper_: u8 =
                unsafe { ::std::mem::transmute(will_dump_with_pdumper_) };
            will_dump_with_pdumper_ as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let dumped_with_pdumper_: u8 = unsafe { ::std::mem::transmute(dumped_with_pdumper_) };
            dumped_with_pdumper_ as u64
        });
        __bindgen_bitfield_unit
    }
}
extern "C" {
    #[link_name = "\u{1}gflags"]
    pub static mut gflags: gflags;
}
extern "C" {
    pub fn will_dump_p() -> bool;
}
extern "C" {
    pub fn will_bootstrap_p() -> bool;
}
extern "C" {
    pub fn will_dump_with_pdumper_p() -> bool;
}
extern "C" {
    pub fn dumped_with_pdumper_p() -> bool;
}
extern "C" {
    pub fn will_dump_with_unexec_p() -> bool;
}
extern "C" {
    pub fn dumped_with_unexec_p() -> bool;
}
extern "C" {
    pub fn definitely_will_not_unexec_p() -> bool;
}
extern "C" {
    pub fn extract_float(arg1: Lisp_Object) -> f64;
}
extern "C" {
    pub fn XLI(o: Lisp_Object) -> EMACS_INT;
}
extern "C" {
    pub fn XIL(i: EMACS_INT) -> Lisp_Object;
}
extern "C" {
    pub fn XLP(o: Lisp_Object) -> *mut ::libc::c_void;
}
extern "C" {
    pub fn XTYPE(a: Lisp_Object) -> Lisp_Type;
}
extern "C" {
    pub fn TAGGEDP(a: Lisp_Object, tag: Lisp_Type) -> bool;
}
extern "C" {
    pub fn CHECK_TYPE(ok: ::libc::c_int, predicate: Lisp_Object, x: Lisp_Object);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lispfwd {
    pub fwdptr: *const ::libc::c_void,
}
#[test]
fn bindgen_test_layout_lispfwd() {
    assert_eq!(
        ::std::mem::size_of::<lispfwd>(),
        8usize,
        concat!("Size of: ", stringify!(lispfwd))
    );
    assert_eq!(
        ::std::mem::align_of::<lispfwd>(),
        8usize,
        concat!("Alignment of ", stringify!(lispfwd))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lispfwd>())).fwdptr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lispfwd),
            "::",
            stringify!(fwdptr)
        )
    );
}
impl Default for lispfwd {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
pub mod symbol_interned {
    pub type Type = u32;
    pub const SYMBOL_UNINTERNED: Type = 0;
    pub const SYMBOL_INTERNED: Type = 1;
    pub const SYMBOL_INTERNED_IN_INITIAL_OBARRAY: Type = 2;
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum symbol_redirect {
    SYMBOL_PLAINVAL = 4,
    SYMBOL_VARALIAS = 1,
    SYMBOL_LOCALIZED = 2,
    SYMBOL_FORWARDED = 3,
}
pub mod symbol_trapped_write {
    pub type Type = u32;
    pub const SYMBOL_UNTRAPPED_WRITE: Type = 0;
    pub const SYMBOL_NOWRITE: Type = 1;
    pub const SYMBOL_TRAPPED_WRITE: Type = 2;
}
#[repr(C)]
pub struct Lisp_Symbol {
    pub u: Lisp_Symbol__bindgen_ty_1,
}
#[repr(C)]
#[repr(align(8))]
pub struct Lisp_Symbol__bindgen_ty_1 {
    pub s: __BindgenUnionField<Lisp_Symbol__bindgen_ty_1__bindgen_ty_1>,
    pub gcaligned: __BindgenUnionField<::libc::c_char>,
    pub bindgen_union_field: [u64; 6usize],
}
#[repr(C)]
pub struct Lisp_Symbol__bindgen_ty_1__bindgen_ty_1 {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 2usize], u8>,
    pub name: Lisp_Object,
    pub val: Lisp_Symbol__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1,
    pub function: Lisp_Object,
    pub plist: Lisp_Object,
    pub next: *mut Lisp_Symbol,
}
#[repr(C)]
#[repr(align(8))]
pub union Lisp_Symbol__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1 {
    pub value: Lisp_Object,
    pub alias: *mut Lisp_Symbol,
    pub blv: *mut Lisp_Buffer_Local_Value,
    pub fwd: lispfwd,
    _bindgen_union_align: u64,
}
#[test]
fn bindgen_test_layout_Lisp_Symbol__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<Lisp_Symbol__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(Lisp_Symbol__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<Lisp_Symbol__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(Lisp_Symbol__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Lisp_Symbol__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1>())).value
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Lisp_Symbol__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(value)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Lisp_Symbol__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1>())).alias
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Lisp_Symbol__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(alias)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Lisp_Symbol__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1>())).blv
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Lisp_Symbol__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(blv)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Lisp_Symbol__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1>())).fwd
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Lisp_Symbol__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(fwd)
        )
    );
}
impl Default for Lisp_Symbol__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1 {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[test]
fn bindgen_test_layout_Lisp_Symbol__bindgen_ty_1__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<Lisp_Symbol__bindgen_ty_1__bindgen_ty_1>(),
        48usize,
        concat!(
            "Size of: ",
            stringify!(Lisp_Symbol__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<Lisp_Symbol__bindgen_ty_1__bindgen_ty_1>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(Lisp_Symbol__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Lisp_Symbol__bindgen_ty_1__bindgen_ty_1>())).name as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Lisp_Symbol__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Lisp_Symbol__bindgen_ty_1__bindgen_ty_1>())).val as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(Lisp_Symbol__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(val)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Lisp_Symbol__bindgen_ty_1__bindgen_ty_1>())).function as *const _
                as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(Lisp_Symbol__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(function)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Lisp_Symbol__bindgen_ty_1__bindgen_ty_1>())).plist as *const _
                as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(Lisp_Symbol__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(plist)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Lisp_Symbol__bindgen_ty_1__bindgen_ty_1>())).next as *const _
                as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(Lisp_Symbol__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(next)
        )
    );
}
impl Default for Lisp_Symbol__bindgen_ty_1__bindgen_ty_1 {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
impl Lisp_Symbol__bindgen_ty_1__bindgen_ty_1 {
    #[inline]
    pub fn gcmarkbit(&self) -> bool_bf {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_gcmarkbit(&mut self, val: bool_bf) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn redirect(&self) -> symbol_redirect {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 3u8) as u32) }
    }
    #[inline]
    pub fn set_redirect(&mut self, val: symbol_redirect) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 3u8, val as u64)
        }
    }
    #[inline]
    pub fn trapped_write(&self) -> symbol_trapped_write::Type {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(4usize, 2u8) as u32) }
    }
    #[inline]
    pub fn set_trapped_write(&mut self, val: symbol_trapped_write::Type) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(4usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn interned(&self) -> ::libc::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(6usize, 2u8) as u32) }
    }
    #[inline]
    pub fn set_interned(&mut self, val: ::libc::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(6usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn declared_special(&self) -> bool_bf {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(8usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_declared_special(&mut self, val: bool_bf) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(8usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn pinned(&self) -> bool_bf {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(9usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_pinned(&mut self, val: bool_bf) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(9usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        gcmarkbit: bool_bf,
        redirect: symbol_redirect,
        trapped_write: symbol_trapped_write::Type,
        interned: ::libc::c_uint,
        declared_special: bool_bf,
        pinned: bool_bf,
    ) -> __BindgenBitfieldUnit<[u8; 2usize], u8> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 2usize], u8> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let gcmarkbit: u8 = unsafe { ::std::mem::transmute(gcmarkbit) };
            gcmarkbit as u64
        });
        __bindgen_bitfield_unit.set(1usize, 3u8, {
            let redirect: u32 = unsafe { ::std::mem::transmute(redirect) };
            redirect as u64
        });
        __bindgen_bitfield_unit.set(4usize, 2u8, {
            let trapped_write: u32 = unsafe { ::std::mem::transmute(trapped_write) };
            trapped_write as u64
        });
        __bindgen_bitfield_unit.set(6usize, 2u8, {
            let interned: u32 = unsafe { ::std::mem::transmute(interned) };
            interned as u64
        });
        __bindgen_bitfield_unit.set(8usize, 1u8, {
            let declared_special: u8 = unsafe { ::std::mem::transmute(declared_special) };
            declared_special as u64
        });
        __bindgen_bitfield_unit.set(9usize, 1u8, {
            let pinned: u8 = unsafe { ::std::mem::transmute(pinned) };
            pinned as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_Lisp_Symbol__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<Lisp_Symbol__bindgen_ty_1>(),
        48usize,
        concat!("Size of: ", stringify!(Lisp_Symbol__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<Lisp_Symbol__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(Lisp_Symbol__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Lisp_Symbol__bindgen_ty_1>())).s as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Lisp_Symbol__bindgen_ty_1),
            "::",
            stringify!(s)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Lisp_Symbol__bindgen_ty_1>())).gcaligned as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Lisp_Symbol__bindgen_ty_1),
            "::",
            stringify!(gcaligned)
        )
    );
}
impl Default for Lisp_Symbol__bindgen_ty_1 {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[test]
fn bindgen_test_layout_Lisp_Symbol() {
    assert_eq!(
        ::std::mem::size_of::<Lisp_Symbol>(),
        48usize,
        concat!("Size of: ", stringify!(Lisp_Symbol))
    );
    assert_eq!(
        ::std::mem::align_of::<Lisp_Symbol>(),
        8usize,
        concat!("Alignment of ", stringify!(Lisp_Symbol))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Lisp_Symbol>())).u as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Lisp_Symbol),
            "::",
            stringify!(u)
        )
    );
}
impl Default for Lisp_Symbol {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
pub type untagged_ptr = *mut ::libc::c_char;
pub type Lisp_Word_tag = usize;
extern "C" {
    #[link_name = "\u{1}globals"]
    pub static mut globals: emacs_globals;
}
extern "C" {
    #[link_name = "\u{1}lispsym"]
    pub static mut lispsym: [Lisp_Symbol; 1346usize];
}
extern "C" {
    pub fn Fabort_minibuffers() -> Lisp_Object;
}
extern "C" {
    pub fn Fabort_recursive_edit() -> Lisp_Object;
}
extern "C" {
    pub fn Fabs(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Faccept_process_output(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
        arg4: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Faccess_file(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Faccessible_keymaps(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Facos(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Factive_minibuffer_window() -> Lisp_Object;
}
extern "C" {
    pub fn Fadd1(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fadd_face_text_property(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
        arg4: Lisp_Object,
        arg5: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fadd_name_to_file(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fadd_text_properties(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
        arg4: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fadd_variable_watcher(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fall_completions(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
        arg4: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fall_threads() -> Lisp_Object;
}
extern "C" {
    pub fn Fand(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fappend(arg1: isize, arg2: *mut Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fapply(arg1: isize, arg2: *mut Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Faref(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Farrayp(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Faset(arg1: Lisp_Object, arg2: Lisp_Object, arg3: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fash(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fasin(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fassoc(arg1: Lisp_Object, arg2: Lisp_Object, arg3: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fassoc_string(arg1: Lisp_Object, arg2: Lisp_Object, arg3: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fassq(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fasync_close_stream(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fasync_handler(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fasync_send_message(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fatan(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fatom(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fautoload(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
        arg4: Lisp_Object,
        arg5: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fautoload_do_load(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fbacktrace__locals(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fbacktrace_debug(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fbacktrace_eval(arg1: Lisp_Object, arg2: Lisp_Object, arg3: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fbacktrace_frame_internal(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fbacktrace_frames_from_thread(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fbackward_char(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fbackward_prefix_chars() -> Lisp_Object;
}
extern "C" {
    pub fn Fbarf_if_buffer_read_only(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fbase64_decode_region(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fbase64_decode_string(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fbase64_encode_region(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fbase64_encode_string(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fbase64url_encode_region(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fbase64url_encode_string(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fbeginning_of_line(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fbidi_find_overridden_directionality(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fbidi_resolved_levels(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fbitmap_spec_p(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fbobp() -> Lisp_Object;
}
extern "C" {
    pub fn Fbolp() -> Lisp_Object;
}
extern "C" {
    pub fn Fbool_vector(arg1: isize, arg2: *mut Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fbool_vector_count_consecutive(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fbool_vector_count_population(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fbool_vector_exclusive_or(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fbool_vector_intersection(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fbool_vector_not(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fbool_vector_p(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fbool_vector_set_difference(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fbool_vector_subsetp(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fbool_vector_union(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fbottom_divider_width(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fboundp(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fbuffer_base_buffer(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fbuffer_chars_modified_tick(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fbuffer_enable_undo(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fbuffer_file_name(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fbuffer_has_markers_at(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fbuffer_hash(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fbuffer_line_statistics(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fbuffer_list(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fbuffer_live_p(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fbuffer_local_value(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fbuffer_local_variables(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fbuffer_modified_p(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fbuffer_modified_tick(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fbuffer_name(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fbuffer_size(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fbuffer_string() -> Lisp_Object;
}
extern "C" {
    pub fn Fbuffer_substring(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fbuffer_substring_no_properties(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fbuffer_swap_text(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fbufferp(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fbury_buffer_internal(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fbyte_code(arg1: Lisp_Object, arg2: Lisp_Object, arg3: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fbyte_code_function_p(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fbyte_to_position(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fbyte_to_string(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fbyteorder() -> Lisp_Object;
}
extern "C" {
    pub fn Fcall_interactively(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fcall_last_kbd_macro(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fcall_process(arg1: isize, arg2: *mut Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fcall_process_region(arg1: isize, arg2: *mut Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fcancel_kbd_macro_events() -> Lisp_Object;
}
extern "C" {
    pub fn Fcapitalize(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fcapitalize_region(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fcapitalize_word(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fcar(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fcar_less_than_car(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fcar_safe(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fcase_table_p(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fcatch(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fcategory_docstring(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fcategory_set_mnemonics(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fcategory_table() -> Lisp_Object;
}
extern "C" {
    pub fn Fcategory_table_p(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fccl_execute(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fccl_execute_on_string(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
        arg4: Lisp_Object,
        arg5: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fccl_program_p(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fcdr(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fcdr_safe(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fceiling(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fchar_after(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fchar_before(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fchar_category_set(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fchar_charset(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fchar_equal(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fchar_or_string_p(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fchar_resolve_modifiers(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fchar_syntax(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fchar_table_extra_slot(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fchar_table_p(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fchar_table_parent(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fchar_table_range(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fchar_table_subtype(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fchar_to_string(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fchar_width(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fcharacterp(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fcharset_after(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fcharset_id_internal(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fcharset_plist(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fcharset_priority_list(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fcharsetp(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fcheck_coding_system(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fcheck_coding_systems_region(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fclear_buffer_auto_save_failure() -> Lisp_Object;
}
extern "C" {
    pub fn Fclear_charset_maps() -> Lisp_Object;
}
extern "C" {
    pub fn Fclear_composition_cache() -> Lisp_Object;
}
extern "C" {
    pub fn Fclear_face_cache(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fclear_font_cache() -> Lisp_Object;
}
extern "C" {
    pub fn Fclear_image_cache(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fclear_string(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fclear_this_command_keys(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fclose_font(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fclrhash(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fcoding_system_aliases(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fcoding_system_base(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fcoding_system_eol_type(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fcoding_system_p(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fcoding_system_plist(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fcoding_system_priority_list(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fcoding_system_put(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fcolor_distance(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
        arg4: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fcolor_gray_p(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fcolor_supported_p(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fcolor_values_from_color_spec(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fcombine_after_change_execute() -> Lisp_Object;
}
extern "C" {
    pub fn Fcommand_error_default_function(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fcommand_modes(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fcommand_remapping(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fcommandp(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fcomp__compile_ctxt_to_file(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fcomp__init_ctxt() -> Lisp_Object;
}
extern "C" {
    pub fn Fcomp__install_trampoline(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fcomp__late_register_subr(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
        arg4: Lisp_Object,
        arg5: Lisp_Object,
        arg6: Lisp_Object,
        arg7: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fcomp__register_lambda(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
        arg4: Lisp_Object,
        arg5: Lisp_Object,
        arg6: Lisp_Object,
        arg7: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fcomp__register_subr(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
        arg4: Lisp_Object,
        arg5: Lisp_Object,
        arg6: Lisp_Object,
        arg7: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fcomp__release_ctxt() -> Lisp_Object;
}
extern "C" {
    pub fn Fcomp__subr_signature(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fcomp_el_to_eln_filename(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fcomp_el_to_eln_rel_filename(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fcomp_libgccjit_version() -> Lisp_Object;
}
extern "C" {
    pub fn Fcomp_native_driver_options_effective_p() -> Lisp_Object;
}
extern "C" {
    pub fn Fcompare_buffer_substrings(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
        arg4: Lisp_Object,
        arg5: Lisp_Object,
        arg6: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fcompare_strings(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
        arg4: Lisp_Object,
        arg5: Lisp_Object,
        arg6: Lisp_Object,
        arg7: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fcompare_window_configurations(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fcompleting_read(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
        arg4: Lisp_Object,
        arg5: Lisp_Object,
        arg6: Lisp_Object,
        arg7: Lisp_Object,
        arg8: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fcompose_region_internal(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
        arg4: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fcompose_string_internal(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
        arg4: Lisp_Object,
        arg5: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fcomposition_get_gstring(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
        arg4: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fcompute_motion(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
        arg4: Lisp_Object,
        arg5: Lisp_Object,
        arg6: Lisp_Object,
        arg7: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fconcat(arg1: isize, arg2: *mut Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fcond(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fcondition_case(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fcondition_mutex(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fcondition_name(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fcondition_notify(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fcondition_variable_p(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fcondition_wait(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fcons(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fconsp(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fconstrain_to_field(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
        arg4: Lisp_Object,
        arg5: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fcontinue_process(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fcontrolling_tty_p(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fcoordinates_in_window_p(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fcopy_alist(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fcopy_category_table(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fcopy_file(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
        arg4: Lisp_Object,
        arg5: Lisp_Object,
        arg6: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fcopy_hash_table(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fcopy_keymap(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fcopy_marker(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fcopy_sequence(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fcopy_syntax_table(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fcopysign(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fcos(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fcurrent_active_maps(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fcurrent_bidi_paragraph_direction(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fcurrent_buffer() -> Lisp_Object;
}
extern "C" {
    pub fn Fcurrent_case_table() -> Lisp_Object;
}
extern "C" {
    pub fn Fcurrent_column() -> Lisp_Object;
}
extern "C" {
    pub fn Fcurrent_global_map() -> Lisp_Object;
}
extern "C" {
    pub fn Fcurrent_idle_time() -> Lisp_Object;
}
extern "C" {
    pub fn Fcurrent_indentation() -> Lisp_Object;
}
extern "C" {
    pub fn Fcurrent_input_mode() -> Lisp_Object;
}
extern "C" {
    pub fn Fcurrent_local_map() -> Lisp_Object;
}
extern "C" {
    pub fn Fcurrent_message() -> Lisp_Object;
}
extern "C" {
    pub fn Fcurrent_minor_mode_maps() -> Lisp_Object;
}
extern "C" {
    pub fn Fcurrent_thread() -> Lisp_Object;
}
extern "C" {
    pub fn Fcurrent_time() -> Lisp_Object;
}
extern "C" {
    pub fn Fcurrent_time_string(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fcurrent_time_zone(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fcurrent_window_configuration(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fdaemon_initialized() -> Lisp_Object;
}
extern "C" {
    pub fn Fdaemonp() -> Lisp_Object;
}
extern "C" {
    pub fn Fdbus__init_bus(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fdbus_get_unique_name(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fdbus_message_internal(arg1: isize, arg2: *mut Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fdebug_timer_check() -> Lisp_Object;
}
extern "C" {
    pub fn Fdeclare_equiv_charset(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
        arg4: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fdecode_big5_char(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fdecode_char(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fdecode_coding_region(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
        arg4: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fdecode_coding_string(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
        arg4: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fdecode_sjis_char(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fdecode_time(arg1: Lisp_Object, arg2: Lisp_Object, arg3: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fdefalias(arg1: Lisp_Object, arg2: Lisp_Object, arg3: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fdefault_boundp(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fdefault_file_modes() -> Lisp_Object;
}
extern "C" {
    pub fn Fdefault_toplevel_value(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fdefault_value(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fdefconst(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fdefine_category(arg1: Lisp_Object, arg2: Lisp_Object, arg3: Lisp_Object)
        -> Lisp_Object;
}
extern "C" {
    pub fn Fdefine_charset_alias(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fdefine_charset_internal(arg1: isize, arg2: *mut Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fdefine_coding_system_alias(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fdefine_coding_system_internal(arg1: isize, arg2: *mut Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fdefine_fringe_bitmap(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
        arg4: Lisp_Object,
        arg5: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fdefine_hash_table_test(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fdefine_key(arg1: Lisp_Object, arg2: Lisp_Object, arg3: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fdefvar(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fdefvaralias(arg1: Lisp_Object, arg2: Lisp_Object, arg3: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fdelete(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fdelete_all_overlays(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fdelete_and_extract_region(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fdelete_char(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fdelete_directory_internal(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fdelete_field(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fdelete_file(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fdelete_frame(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fdelete_other_windows_internal(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fdelete_overlay(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fdelete_process(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fdelete_region(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fdelete_terminal(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fdelete_window_internal(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fdelq(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fdeno(arg1: isize, arg2: *mut Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fdescribe_buffer_bindings(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fdescribe_vector(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fdestroy_fringe_bitmap(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fdetect_coding_region(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fdetect_coding_string(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fding(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fdirectory_file_name(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fdirectory_files(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
        arg4: Lisp_Object,
        arg5: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fdirectory_files_and_attributes(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
        arg4: Lisp_Object,
        arg5: Lisp_Object,
        arg6: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fdirectory_name_p(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fdiscard_input() -> Lisp_Object;
}
extern "C" {
    pub fn Fdisplay__update_for_mouse_movement(arg1: Lisp_Object, arg2: Lisp_Object)
        -> Lisp_Object;
}
extern "C" {
    pub fn Fdisplay_supports_face_attributes_p(arg1: Lisp_Object, arg2: Lisp_Object)
        -> Lisp_Object;
}
extern "C" {
    pub fn Fdo_auto_save(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fdocumentation(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fdocumentation_property(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fdowncase(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fdowncase_region(arg1: Lisp_Object, arg2: Lisp_Object, arg3: Lisp_Object)
        -> Lisp_Object;
}
extern "C" {
    pub fn Fdowncase_word(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fdraw_string(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fdump_colors() -> Lisp_Object;
}
extern "C" {
    pub fn Fdump_emacs(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fdump_emacs_portable(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fdump_emacs_portable__sort_predicate(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fdump_emacs_portable__sort_predicate_copied(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fdump_face(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fdump_frame_glyph_matrix() -> Lisp_Object;
}
extern "C" {
    pub fn Fdump_glyph_matrix(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fdump_glyph_row(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fdump_redisplay_history() -> Lisp_Object;
}
extern "C" {
    pub fn Fdump_tab_bar_row(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fdump_tool_bar_row(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Felt(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Femacs_pid() -> Lisp_Object;
}
extern "C" {
    pub fn Fencode_big5_char(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fencode_char(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fencode_coding_region(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
        arg4: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fencode_coding_string(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
        arg4: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fencode_sjis_char(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fencode_time(arg1: isize, arg2: *mut Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fend_kbd_macro(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fend_of_line(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Feobp() -> Lisp_Object;
}
extern "C" {
    pub fn Feolp() -> Lisp_Object;
}
extern "C" {
    pub fn Feq(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Feql(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Feqlsign(arg1: isize, arg2: *mut Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fequal(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fequal_including_properties(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Ferase_buffer() -> Lisp_Object;
}
extern "C" {
    pub fn Ferror_message_string(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Feval(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Feval_buffer(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
        arg4: Lisp_Object,
        arg5: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Feval_js(arg1: isize, arg2: *mut Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Feval_js_buffer(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Feval_js_buffer_literally(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Feval_js_expression(arg1: isize, arg2: *mut Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Feval_js_file(arg1: isize, arg2: *mut Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Feval_js_literally(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Feval_js_region(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Feval_js_region_literally(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Feval_region(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
        arg4: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Feval_ts_buffer(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Feval_ts_region(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fevent_convert_list(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fevent_symbol_parse_modifiers(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fexecute_kbd_macro(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fexit_recursive_edit() -> Lisp_Object;
}
extern "C" {
    pub fn Fexp(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fexpand_file_name(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fexpt(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fexternal_debugging_output(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fface_attribute_relative_p(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fface_attributes_as_vector(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fface_font(arg1: Lisp_Object, arg2: Lisp_Object, arg3: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Ffboundp(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Ffceiling(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Ffeaturep(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Ffetch_bytecode(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fffloor(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Ffield_beginning(arg1: Lisp_Object, arg2: Lisp_Object, arg3: Lisp_Object)
        -> Lisp_Object;
}
extern "C" {
    pub fn Ffield_end(arg1: Lisp_Object, arg2: Lisp_Object, arg3: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Ffield_string(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Ffield_string_no_properties(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Ffile_accessible_directory_p(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Ffile_acl(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Ffile_attributes(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Ffile_attributes_lessp(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Ffile_directory_p(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Ffile_executable_p(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Ffile_exists_p(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Ffile_locked_p(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Ffile_modes(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Ffile_name_absolute_p(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Ffile_name_all_completions(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Ffile_name_as_directory(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Ffile_name_case_insensitive_p(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Ffile_name_completion(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Ffile_name_directory(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Ffile_name_nondirectory(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Ffile_newer_than_file_p(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Ffile_readable_p(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Ffile_regular_p(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Ffile_selinux_context(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Ffile_symlink_p(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Ffile_system_info(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Ffile_writable_p(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Ffillarray(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Ffind_charset_region(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Ffind_charset_string(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Ffind_coding_systems_region_internal(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Ffind_composition_internal(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
        arg4: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Ffind_file_name_handler(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Ffind_font(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Ffind_operation_coding_system(arg1: isize, arg2: *mut Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Ffloat(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Ffloat_time(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Ffloatp(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Ffloor(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Ffmakunbound(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Ffollowing_char() -> Lisp_Object;
}
extern "C" {
    pub fn Ffont_at(arg1: Lisp_Object, arg2: Lisp_Object, arg3: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Ffont_drive_otf(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
        arg4: Lisp_Object,
        arg5: Lisp_Object,
        arg6: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Ffont_face_attributes(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Ffont_family_list(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Ffont_get(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Ffont_get_glyphs(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
        arg4: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Ffont_info(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Ffont_match_p(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Ffont_otf_alternates(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Ffont_put(arg1: Lisp_Object, arg2: Lisp_Object, arg3: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Ffont_shape_gstring(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Ffont_spec(arg1: isize, arg2: *mut Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Ffont_variation_glyphs(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Ffont_xlfd_name(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Ffontp(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Ffontset_font(arg1: Lisp_Object, arg2: Lisp_Object, arg3: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Ffontset_info(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Ffontset_list() -> Lisp_Object;
}
extern "C" {
    pub fn Ffontset_list_all() -> Lisp_Object;
}
extern "C" {
    pub fn Fforce_mode_line_update(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fforce_window_update(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fformat(arg1: isize, arg2: *mut Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fformat_message(arg1: isize, arg2: *mut Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fformat_mode_line(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
        arg4: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fformat_network_address(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fformat_time_string(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fforward_char(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fforward_comment(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fforward_line(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fforward_word(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fframe_after_make_frame(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fframe_ancestor_p(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fframe_char_height(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fframe_char_width(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fframe_child_frame_border_width(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fframe_face_alist(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fframe_first_window(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fframe_focus(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fframe_font_cache(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fframe_internal_border_width(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fframe_list() -> Lisp_Object;
}
extern "C" {
    pub fn Fframe_live_p(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fframe_native_height(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fframe_native_width(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fframe_old_selected_window(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fframe_or_buffer_changed_p(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fframe_parameter(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fframe_parameters(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fframe_parent(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fframe_pointer_visible_p(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fframe_position(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fframe_root_window(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fframe_selected_window(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fframe_terminal(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fframe_text_cols(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fframe_text_height(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fframe_text_lines(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fframe_text_width(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fframe_total_cols(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fframe_total_lines(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fframe_visible_p(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fframe_window_state_change(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fframe_windows_min_size(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
        arg4: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fframep(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Ffrexp(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Ffringe_bitmaps_at_pos(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Ffringe_width(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Ffround(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Ffset(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fftruncate(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Ffunc_arity(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Ffuncall(arg1: isize, arg2: *mut Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Ffuncall_interactively(arg1: isize, arg2: *mut Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Ffunction(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Ffunction_equal(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Ffunctionp(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fgap_position() -> Lisp_Object;
}
extern "C" {
    pub fn Fgap_size() -> Lisp_Object;
}
extern "C" {
    pub fn Fgarbage_collect() -> Lisp_Object;
}
extern "C" {
    pub fn Fgarbage_collect_maybe(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fgenerate_new_buffer_name(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fgeq(arg1: isize, arg2: *mut Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fget(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fget_buffer(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fget_buffer_create(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fget_buffer_process(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fget_buffer_window(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fget_byte(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fget_char_property(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fget_char_property_and_overlay(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fget_file_buffer(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fget_file_char() -> Lisp_Object;
}
extern "C" {
    pub fn Fget_internal_run_time() -> Lisp_Object;
}
extern "C" {
    pub fn Fget_load_suffixes() -> Lisp_Object;
}
extern "C" {
    pub fn Fget_pos_property(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fget_process(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fget_text_property(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fget_unicode_property_internal(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fget_unused_category(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fget_unused_iso_final_char(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fget_variable_watchers(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fgetenv_internal(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fgethash(arg1: Lisp_Object, arg2: Lisp_Object, arg3: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fgit_init(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fgnutls_asynchronous_parameters(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fgnutls_available_p() -> Lisp_Object;
}
extern "C" {
    pub fn Fgnutls_boot(arg1: Lisp_Object, arg2: Lisp_Object, arg3: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fgnutls_bye(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fgnutls_ciphers() -> Lisp_Object;
}
extern "C" {
    pub fn Fgnutls_deinit(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fgnutls_digests() -> Lisp_Object;
}
extern "C" {
    pub fn Fgnutls_error_fatalp(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fgnutls_error_string(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fgnutls_errorp(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fgnutls_format_certificate(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fgnutls_get_initstage(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fgnutls_hash_digest(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fgnutls_hash_mac(arg1: Lisp_Object, arg2: Lisp_Object, arg3: Lisp_Object)
        -> Lisp_Object;
}
extern "C" {
    pub fn Fgnutls_macs() -> Lisp_Object;
}
extern "C" {
    pub fn Fgnutls_peer_status(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fgnutls_peer_status_warning_describe(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fgnutls_symmetric_decrypt(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
        arg4: Lisp_Object,
        arg5: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fgnutls_symmetric_encrypt(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
        arg4: Lisp_Object,
        arg5: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fgoto_char(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fgpm_mouse_start() -> Lisp_Object;
}
extern "C" {
    pub fn Fgpm_mouse_stop() -> Lisp_Object;
}
extern "C" {
    pub fn Fgroup_gid() -> Lisp_Object;
}
extern "C" {
    pub fn Fgroup_name(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fgroup_real_gid() -> Lisp_Object;
}
extern "C" {
    pub fn Fgtr(arg1: isize, arg2: *mut Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fhandle_switch_frame(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fhash_table_count(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fhash_table_p(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fhash_table_rehash_size(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fhash_table_rehash_threshold(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fhash_table_size(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fhash_table_test(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fhash_table_weakness(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fhelp__describe_vector(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
        arg4: Lisp_Object,
        arg5: Lisp_Object,
        arg6: Lisp_Object,
        arg7: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Ficonify_frame(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fidentity(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fif(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fimage_cache_size() -> Lisp_Object;
}
extern "C" {
    pub fn Fimage_flush(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fimage_mask_p(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fimage_metadata(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fimage_size(arg1: Lisp_Object, arg2: Lisp_Object, arg3: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fimage_transforms_p(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fimagemagick_types() -> Lisp_Object;
}
extern "C" {
    pub fn Fimagep(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Findent_to(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Findirect_function(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Findirect_variable(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Finit_image_library(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Finnermost_minibuffer_p(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Finotify_add_watch(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Finotify_allocated_p() -> Lisp_Object;
}
extern "C" {
    pub fn Finotify_rm_watch(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Finotify_valid_p(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Finotify_watch_list() -> Lisp_Object;
}
extern "C" {
    pub fn Finput_pending_p(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Finsert(arg1: isize, arg2: *mut Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Finsert_and_inherit(arg1: isize, arg2: *mut Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Finsert_and_inherit_before_markers(arg1: isize, arg2: *mut Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Finsert_before_markers(arg1: isize, arg2: *mut Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Finsert_buffer_substring(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Finsert_byte(arg1: Lisp_Object, arg2: Lisp_Object, arg3: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Finsert_char(arg1: Lisp_Object, arg2: Lisp_Object, arg3: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Finsert_file_contents(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
        arg4: Lisp_Object,
        arg5: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Finteger_or_marker_p(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fintegerp(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Finteractive(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Finteractive_form(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fintern(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fintern_soft(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Finternal__define_uninitialized_variable(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Finternal_char_font(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Finternal_complete_buffer(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Finternal_copy_lisp_face(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
        arg4: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Finternal_decode_string_utf_8(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
        arg4: Lisp_Object,
        arg5: Lisp_Object,
        arg6: Lisp_Object,
        arg7: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Finternal_default_interrupt_process(arg1: Lisp_Object, arg2: Lisp_Object)
        -> Lisp_Object;
}
extern "C" {
    pub fn Finternal_default_process_filter(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Finternal_default_process_sentinel(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Finternal_describe_syntax_value(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Finternal_encode_string_utf_8(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
        arg4: Lisp_Object,
        arg5: Lisp_Object,
        arg6: Lisp_Object,
        arg7: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Finternal_face_x_get_resource(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Finternal_get_lisp_face_attribute(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Finternal_handle_focus_in(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Finternal_lisp_face_attribute_values(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Finternal_lisp_face_empty_p(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Finternal_lisp_face_equal_p(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Finternal_lisp_face_p(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Finternal_make_lisp_face(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Finternal_merge_in_global_face(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Finternal_set_alternative_font_family_alist(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Finternal_set_alternative_font_registry_alist(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Finternal_set_font_selection_order(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Finternal_set_lisp_face_attribute(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
        arg4: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Finternal_set_lisp_face_attribute_from_resource(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
        arg4: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Finternal_show_cursor(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Finternal_show_cursor_p(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Finternal_track_mouse(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Finterrupt_process(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Finvisible_p(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Finvocation_directory() -> Lisp_Object;
}
extern "C" {
    pub fn Finvocation_name() -> Lisp_Object;
}
extern "C" {
    pub fn Fisnan(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fiso_charset(arg1: Lisp_Object, arg2: Lisp_Object, arg3: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fjs__clear(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fjs__reenter(arg1: isize, arg2: *mut Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fjs__sweep() -> Lisp_Object;
}
extern "C" {
    pub fn Fjs_cleanup() -> Lisp_Object;
}
extern "C" {
    pub fn Fjs_get_tick_rate() -> Lisp_Object;
}
extern "C" {
    pub fn Fjs_initialize(arg1: isize, arg2: *mut Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fjs_set_tick_rate(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fjs_tick_event_loop(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fjson_de(arg1: isize, arg2: *mut Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fjson_insert(arg1: isize, arg2: *mut Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fjson_parse_buffer(arg1: isize, arg2: *mut Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fjson_parse_string(arg1: isize, arg2: *mut Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fjson_se(arg1: isize, arg2: *mut Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fjson_serialize(arg1: isize, arg2: *mut Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fkey_binding(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
        arg4: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fkey_description(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fkeyboard_coding_system(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fkeymap__get_keyelt(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fkeymap_parent(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fkeymap_prompt(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fkeymapp(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fkeywordp(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fkill_all_local_variables() -> Lisp_Object;
}
extern "C" {
    pub fn Fkill_buffer(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fkill_emacs(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fkill_local_variable(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fkill_process(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Flast_nonminibuf_frame() -> Lisp_Object;
}
extern "C" {
    pub fn Flax_plist_get(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Flax_plist_put(arg1: Lisp_Object, arg2: Lisp_Object, arg3: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Flcms2_available_p() -> Lisp_Object;
}
extern "C" {
    pub fn Flcms_cam02_ucs(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
        arg4: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Flcms_cie_de2000(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
        arg4: Lisp_Object,
        arg5: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Flcms_jab_to_jch(arg1: Lisp_Object, arg2: Lisp_Object, arg3: Lisp_Object)
        -> Lisp_Object;
}
extern "C" {
    pub fn Flcms_jch_to_jab(arg1: Lisp_Object, arg2: Lisp_Object, arg3: Lisp_Object)
        -> Lisp_Object;
}
extern "C" {
    pub fn Flcms_jch_to_xyz(arg1: Lisp_Object, arg2: Lisp_Object, arg3: Lisp_Object)
        -> Lisp_Object;
}
extern "C" {
    pub fn Flcms_temp_to_white_point(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Flcms_xyz_to_jch(arg1: Lisp_Object, arg2: Lisp_Object, arg3: Lisp_Object)
        -> Lisp_Object;
}
extern "C" {
    pub fn Fldexp(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Flength(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Flength_equal(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Flength_greater(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Flength_less(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fleq(arg1: isize, arg2: *mut Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Flet(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn FletX(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Flibxml_available_p() -> Lisp_Object;
}
extern "C" {
    pub fn Flibxml_parse_html_region(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
        arg4: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Flibxml_parse_xml_region(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
        arg4: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fline_beginning_position(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fline_end_position(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fline_number_at_pos(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fline_number_display_width(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fline_pixel_height() -> Lisp_Object;
}
extern "C" {
    pub fn Flist(arg1: isize, arg2: *mut Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Flist_fonts(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
        arg4: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Flist_system_processes() -> Lisp_Object;
}
extern "C" {
    pub fn Flistp(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fload(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
        arg4: Lisp_Object,
        arg5: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fload_average(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Flocal_variable_if_set_p(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Flocal_variable_p(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Flocale_info(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Flocate_file_internal(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
        arg4: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Flock_buffer(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Flog(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Flogand(arg1: isize, arg2: *mut Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Flogb(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Flogcount(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Flogior(arg1: isize, arg2: *mut Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Flognot(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Flogxor(arg1: isize, arg2: *mut Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Flooking_at(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Flookup_image(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Flookup_image_map(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Flookup_key(arg1: Lisp_Object, arg2: Lisp_Object, arg3: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Flossage_size(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Flower_frame(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Flread__substitute_object_in_subtree(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Flsp_async_send_request(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Flsp_handler(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Flsp_json_config(arg1: isize, arg2: *mut Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Flss(arg1: isize, arg2: *mut Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fmacroexpand(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fmake_bool_vector(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fmake_byte_code(arg1: isize, arg2: *mut Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fmake_category_set(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fmake_category_table() -> Lisp_Object;
}
extern "C" {
    pub fn Fmake_char(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
        arg4: Lisp_Object,
        arg5: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fmake_char_table(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fmake_closure(arg1: isize, arg2: *mut Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fmake_condition_variable(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fmake_directory_internal(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fmake_finalizer(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fmake_frame_invisible(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fmake_frame_visible(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fmake_hash_table(arg1: isize, arg2: *mut Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fmake_indirect_buffer(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fmake_keymap(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fmake_list(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fmake_local_variable(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fmake_lsp_connection(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fmake_marker() -> Lisp_Object;
}
extern "C" {
    pub fn Fmake_mutex(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fmake_network_process(arg1: isize, arg2: *mut Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fmake_overlay(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
        arg4: Lisp_Object,
        arg5: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fmake_pipe_process(arg1: isize, arg2: *mut Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fmake_process(arg1: isize, arg2: *mut Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fmake_record(arg1: Lisp_Object, arg2: Lisp_Object, arg3: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fmake_serial_process(arg1: isize, arg2: *mut Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fmake_sparse_keymap(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fmake_string(arg1: Lisp_Object, arg2: Lisp_Object, arg3: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fmake_symbol(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fmake_symbolic_link(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fmake_temp_file_internal(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
        arg4: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fmake_temp_name(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fmake_terminal_frame(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fmake_thread(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fmake_var_non_special(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fmake_variable_buffer_local(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fmake_vector(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fmakunbound(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fmalloc_info() -> Lisp_Object;
}
extern "C" {
    pub fn Fmap_char_table(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fmap_charset_chars(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
        arg4: Lisp_Object,
        arg5: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fmap_keymap(arg1: Lisp_Object, arg2: Lisp_Object, arg3: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fmap_keymap_internal(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fmapatoms(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fmapbacktrace(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fmapcan(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fmapcar(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fmapconcat(arg1: Lisp_Object, arg2: Lisp_Object, arg3: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fmaphash(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fmark_marker() -> Lisp_Object;
}
extern "C" {
    pub fn Fmarker_buffer(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fmarker_insertion_type(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fmarker_position(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fmarkerp(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fmatch_beginning(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fmatch_data(arg1: Lisp_Object, arg2: Lisp_Object, arg3: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fmatch_data__translate(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fmatch_end(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fmatching_paren(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fmax(arg1: isize, arg2: *mut Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fmax_char() -> Lisp_Object;
}
extern "C" {
    pub fn Fmd5(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
        arg4: Lisp_Object,
        arg5: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fmember(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fmemory_info() -> Lisp_Object;
}
extern "C" {
    pub fn Fmemory_use_counts() -> Lisp_Object;
}
extern "C" {
    pub fn Fmemq(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fmemql(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fmenu_bar_menu_at_x_y(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fmerge_face_attribute(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fmessage(arg1: isize, arg2: *mut Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fmessage_box(arg1: isize, arg2: *mut Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fmessage_or_box(arg1: isize, arg2: *mut Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fmin(arg1: isize, arg2: *mut Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fminibuffer_contents() -> Lisp_Object;
}
extern "C" {
    pub fn Fminibuffer_contents_no_properties() -> Lisp_Object;
}
extern "C" {
    pub fn Fminibuffer_depth() -> Lisp_Object;
}
extern "C" {
    pub fn Fminibuffer_innermost_command_loop_p(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fminibuffer_prompt() -> Lisp_Object;
}
extern "C" {
    pub fn Fminibuffer_prompt_end() -> Lisp_Object;
}
extern "C" {
    pub fn Fminibuffer_selected_window() -> Lisp_Object;
}
extern "C" {
    pub fn Fminibuffer_window(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fminibufferp(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fminor_mode_key_binding(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fminus(arg1: isize, arg2: *mut Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fmod(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fmodify_category_entry(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
        arg4: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fmodify_frame_parameters(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fmodify_syntax_entry(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fmodule_function_p(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fmodule_load(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fmouse_pixel_position() -> Lisp_Object;
}
extern "C" {
    pub fn Fmouse_position() -> Lisp_Object;
}
extern "C" {
    pub fn Fmove_overlay(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
        arg4: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fmove_point_visually(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fmove_to_column(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fmove_to_window_line(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fmultibyte_char_to_unibyte(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fmultibyte_string_p(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fmutex_lock(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fmutex_name(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fmutex_unlock(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fmutexp(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fnarrow_to_region(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fnative_comp_available_p() -> Lisp_Object;
}
extern "C" {
    pub fn Fnative_comp_unit_file(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fnative_comp_unit_set_file(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fnative_elisp_load(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fnatnump(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fnconc(arg1: isize, arg2: *mut Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fneq(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fnetwork_interface_info(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fnetwork_interface_list(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fnetwork_lookup_address_info(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fnew_fontset(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fnewline_cache_check(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fnext_char_property_change(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fnext_frame(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fnext_overlay_change(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fnext_property_change(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fnext_read_file_uses_dialog_p() -> Lisp_Object;
}
extern "C" {
    pub fn Fnext_single_char_property_change(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
        arg4: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fnext_single_property_change(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
        arg4: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fnext_window(arg1: Lisp_Object, arg2: Lisp_Object, arg3: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fng_module_function_address(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fngettext(arg1: Lisp_Object, arg2: Lisp_Object, arg3: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fnlistp(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fnreverse(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fnth(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fnthcdr(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fnull(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fnumber_or_marker_p(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fnumber_to_string(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fnumberp(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fobject_intervals(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fold_selected_frame() -> Lisp_Object;
}
extern "C" {
    pub fn Fold_selected_window() -> Lisp_Object;
}
extern "C" {
    pub fn Fopen_dribble_file(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fopen_font(arg1: Lisp_Object, arg2: Lisp_Object, arg3: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fopen_termscript(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Foptimize_char_table(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn For(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fother_buffer(arg1: Lisp_Object, arg2: Lisp_Object, arg3: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fother_window_for_scrolling() -> Lisp_Object;
}
extern "C" {
    pub fn Foverlay_buffer(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Foverlay_end(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Foverlay_get(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Foverlay_lists() -> Lisp_Object;
}
extern "C" {
    pub fn Foverlay_properties(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Foverlay_put(arg1: Lisp_Object, arg2: Lisp_Object, arg3: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Foverlay_recenter(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Foverlay_start(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Foverlayp(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Foverlays_at(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Foverlays_in(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fparse_partial_sexp(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
        arg4: Lisp_Object,
        arg5: Lisp_Object,
        arg6: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fpdumper_stats() -> Lisp_Object;
}
extern "C" {
    pub fn Fplay_sound_internal(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fplist_get(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fplist_member(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fplist_put(arg1: Lisp_Object, arg2: Lisp_Object, arg3: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fplus(arg1: isize, arg2: *mut Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fpoint() -> Lisp_Object;
}
extern "C" {
    pub fn Fpoint_marker() -> Lisp_Object;
}
extern "C" {
    pub fn Fpoint_max() -> Lisp_Object;
}
extern "C" {
    pub fn Fpoint_max_marker() -> Lisp_Object;
}
extern "C" {
    pub fn Fpoint_min() -> Lisp_Object;
}
extern "C" {
    pub fn Fpoint_min_marker() -> Lisp_Object;
}
extern "C" {
    pub fn Fpos_visible_in_window_p(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fposition_bytes(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fposix_looking_at(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fposix_search_backward(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
        arg4: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fposix_search_forward(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
        arg4: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fposix_string_match(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fposn_at_point(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fposn_at_x_y(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
        arg4: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fprefix_numeric_value(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fprevious_char() -> Lisp_Object;
}
extern "C" {
    pub fn Fprevious_char_property_change(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fprevious_frame(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fprevious_overlay_change(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fprevious_property_change(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fprevious_single_char_property_change(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
        arg4: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fprevious_single_property_change(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
        arg4: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fprevious_window(arg1: Lisp_Object, arg2: Lisp_Object, arg3: Lisp_Object)
        -> Lisp_Object;
}
extern "C" {
    pub fn Fprin1(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fprin1_to_string(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fprinc(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fprint(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fprint_preprocess(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fprocess_attributes(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fprocess_buffer(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fprocess_coding_system(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fprocess_command(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fprocess_connection(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fprocess_contact(arg1: Lisp_Object, arg2: Lisp_Object, arg3: Lisp_Object)
        -> Lisp_Object;
}
extern "C" {
    pub fn Fprocess_datagram_address(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fprocess_exit_status(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fprocess_filter(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fprocess_filter_multibyte_p(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fprocess_id(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fprocess_inherit_coding_system_flag(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fprocess_list() -> Lisp_Object;
}
extern "C" {
    pub fn Fprocess_mark(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fprocess_name(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fprocess_plist(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fprocess_query_on_exit_flag(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fprocess_running_child_p(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fprocess_send_eof(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fprocess_send_region(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fprocess_send_string(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fprocess_sentinel(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fprocess_status(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fprocess_thread(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fprocess_tty_name(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fprocess_type(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fprocessp(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fprofiler_cpu_log() -> Lisp_Object;
}
extern "C" {
    pub fn Fprofiler_cpu_running_p() -> Lisp_Object;
}
extern "C" {
    pub fn Fprofiler_cpu_start(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fprofiler_cpu_stop() -> Lisp_Object;
}
extern "C" {
    pub fn Fprofiler_memory_log() -> Lisp_Object;
}
extern "C" {
    pub fn Fprofiler_memory_running_p() -> Lisp_Object;
}
extern "C" {
    pub fn Fprofiler_memory_start() -> Lisp_Object;
}
extern "C" {
    pub fn Fprofiler_memory_stop() -> Lisp_Object;
}
extern "C" {
    pub fn Fprog1(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fprogn(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fproper_list_p(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fpropertize(arg1: isize, arg2: *mut Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fprovide(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fpurecopy(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fput(arg1: Lisp_Object, arg2: Lisp_Object, arg3: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fput_text_property(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
        arg4: Lisp_Object,
        arg5: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fput_unicode_property_internal(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fputhash(arg1: Lisp_Object, arg2: Lisp_Object, arg3: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fquery_font(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fquery_fontset(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fquit_process(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fquo(arg1: isize, arg2: *mut Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fquote(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fraise_frame(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Frandom(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Frassoc(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Frassq(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fre_search_backward(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
        arg4: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fre_search_forward(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
        arg4: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fread(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fread_buffer(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
        arg4: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fread_char(arg1: Lisp_Object, arg2: Lisp_Object, arg3: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fread_char_exclusive(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fread_coding_system(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fread_command(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fread_event(arg1: Lisp_Object, arg2: Lisp_Object, arg3: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fread_from_minibuffer(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
        arg4: Lisp_Object,
        arg5: Lisp_Object,
        arg6: Lisp_Object,
        arg7: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fread_from_string(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fread_function(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fread_key_sequence(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
        arg4: Lisp_Object,
        arg5: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fread_key_sequence_vector(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
        arg4: Lisp_Object,
        arg5: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fread_no_blanks_input(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fread_non_nil_coding_system(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fread_string(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
        arg4: Lisp_Object,
        arg5: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fread_variable(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Frecent_auto_save_p() -> Lisp_Object;
}
extern "C" {
    pub fn Frecent_keys(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Frecenter(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Frecord(arg1: isize, arg2: *mut Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Frecordp(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Frecursion_depth() -> Lisp_Object;
}
extern "C" {
    pub fn Frecursive_edit() -> Lisp_Object;
}
extern "C" {
    pub fn Fredirect_debugging_output(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fredirect_frame_focus(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fredisplay(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fredraw_display() -> Lisp_Object;
}
extern "C" {
    pub fn Fredraw_frame(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fregexp_quote(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fregion_beginning() -> Lisp_Object;
}
extern "C" {
    pub fn Fregion_end() -> Lisp_Object;
}
extern "C" {
    pub fn Fregister_ccl_program(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fregister_code_conversion_map(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Frem(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fremhash(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fremove_list_of_text_properties(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
        arg4: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fremove_text_properties(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
        arg4: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fremove_variable_watcher(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Frename_buffer(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Frename_file(arg1: Lisp_Object, arg2: Lisp_Object, arg3: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Freplace_buffer_contents(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Freplace_match(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
        arg4: Lisp_Object,
        arg5: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Frequire(arg1: Lisp_Object, arg2: Lisp_Object, arg3: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fresize_mini_window_internal(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Frestore_buffer_modified_p(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fresume_tty(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Freverse(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fright_divider_width(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fround(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Frun_hook_with_args(arg1: isize, arg2: *mut Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Frun_hook_with_args_until_failure(arg1: isize, arg2: *mut Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Frun_hook_with_args_until_success(arg1: isize, arg2: *mut Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Frun_hook_wrapped(arg1: isize, arg2: *mut Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Frun_hooks(arg1: isize, arg2: *mut Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Frun_window_configuration_change_hook(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Frun_window_scroll_functions(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fsafe_length(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fsave_current_buffer(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fsave_excursion(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fsave_restriction(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fscan_lists(arg1: Lisp_Object, arg2: Lisp_Object, arg3: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fscan_sexps(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fscroll_bar_height(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fscroll_bar_width(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fscroll_down(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fscroll_left(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fscroll_other_window(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fscroll_other_window_down(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fscroll_right(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fscroll_up(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fsearch_backward(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
        arg4: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fsearch_forward(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
        arg4: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fsecure_hash(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
        arg4: Lisp_Object,
        arg5: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fsecure_hash_algorithms() -> Lisp_Object;
}
extern "C" {
    pub fn Fselect_frame(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fselect_window(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fselected_frame() -> Lisp_Object;
}
extern "C" {
    pub fn Fselected_window() -> Lisp_Object;
}
extern "C" {
    pub fn Fself_insert_command(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fsend_string_to_terminal(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fsequencep(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fserial_process_configure(arg1: isize, arg2: *mut Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fset(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fset__this_command_keys(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fset_binary_mode(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fset_buffer(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fset_buffer_auto_saved() -> Lisp_Object;
}
extern "C" {
    pub fn Fset_buffer_major_mode(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fset_buffer_modified_p(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fset_buffer_multibyte(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fset_buffer_redisplay(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
        arg4: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fset_case_table(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fset_category_table(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fset_char_table_extra_slot(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fset_char_table_parent(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fset_char_table_range(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fset_charset_plist(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fset_charset_priority(arg1: isize, arg2: *mut Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fset_coding_system_priority(arg1: isize, arg2: *mut Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fset_default(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fset_default_file_modes(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fset_default_toplevel_value(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fset_file_acl(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fset_file_modes(arg1: Lisp_Object, arg2: Lisp_Object, arg3: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fset_file_selinux_context(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fset_file_times(arg1: Lisp_Object, arg2: Lisp_Object, arg3: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fset_fontset_font(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
        arg4: Lisp_Object,
        arg5: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fset_frame_height(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
        arg4: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fset_frame_position(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fset_frame_selected_window(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fset_frame_size(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
        arg4: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fset_frame_width(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
        arg4: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fset_frame_window_state_change(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fset_fringe_bitmap_face(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fset_input_interrupt_mode(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fset_input_meta_mode(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fset_input_mode(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
        arg4: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fset_keyboard_coding_system_internal(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fset_keymap_parent(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fset_marker(arg1: Lisp_Object, arg2: Lisp_Object, arg3: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fset_marker_insertion_type(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fset_match_data(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fset_minibuffer_window(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fset_mouse_pixel_position(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fset_mouse_position(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fset_network_process_option(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
        arg4: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fset_output_flow_control(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fset_process_buffer(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fset_process_coding_system(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fset_process_datagram_address(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fset_process_filter(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fset_process_filter_multibyte(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fset_process_inherit_coding_system_flag(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fset_process_plist(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fset_process_query_on_exit_flag(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fset_process_sentinel(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fset_process_thread(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fset_process_window_size(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fset_quit_char(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fset_safe_terminal_coding_system_internal(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fset_standard_case_table(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fset_syntax_table(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fset_terminal_coding_system_internal(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fset_terminal_parameter(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fset_text_properties(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
        arg4: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fset_time_zone_rule(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fset_visited_file_modtime(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fset_window_buffer(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fset_window_combination_limit(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fset_window_configuration(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fset_window_dedicated_p(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fset_window_display_table(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fset_window_fringes(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
        arg4: Lisp_Object,
        arg5: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fset_window_hscroll(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fset_window_margins(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fset_window_new_normal(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fset_window_new_pixel(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fset_window_new_total(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fset_window_next_buffers(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fset_window_parameter(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fset_window_point(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fset_window_prev_buffers(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fset_window_redisplay_end_trigger(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fset_window_scroll_bars(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
        arg4: Lisp_Object,
        arg5: Lisp_Object,
        arg6: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fset_window_start(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fset_window_vscroll(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fsetcar(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fsetcdr(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fsetplist(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fsetq(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fshow_face_resources() -> Lisp_Object;
}
extern "C" {
    pub fn Fsignal_process(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fsin(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fsingle_key_description(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fskip_chars_backward(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fskip_chars_forward(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fskip_syntax_backward(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fskip_syntax_forward(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fsleep_for(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fsnarf_documentation(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fsort(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fsort_charsets(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fspecial_variable_p(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fsplit_char(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fsplit_window_internal(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
        arg4: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fsqrt(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fstandard_case_table() -> Lisp_Object;
}
extern "C" {
    pub fn Fstandard_category_table() -> Lisp_Object;
}
extern "C" {
    pub fn Fstandard_syntax_table() -> Lisp_Object;
}
extern "C" {
    pub fn Fstart_kbd_macro(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fstop_process(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fstore_kbd_macro_event(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fstring(arg1: isize, arg2: *mut Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fstring_as_multibyte(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fstring_as_unibyte(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fstring_bytes(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fstring_collate_equalp(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
        arg4: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fstring_collate_lessp(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
        arg4: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fstring_distance(arg1: Lisp_Object, arg2: Lisp_Object, arg3: Lisp_Object)
        -> Lisp_Object;
}
extern "C" {
    pub fn Fstring_equal(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fstring_lessp(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fstring_make_multibyte(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fstring_make_unibyte(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fstring_match(arg1: Lisp_Object, arg2: Lisp_Object, arg3: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fstring_search(arg1: Lisp_Object, arg2: Lisp_Object, arg3: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fstring_to_char(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fstring_to_multibyte(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fstring_to_number(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fstring_to_syntax(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fstring_to_unibyte(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fstring_version_lessp(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fstring_width(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fstringp(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fsub1(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fsubr_arity(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fsubr_name(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fsubr_native_comp_unit(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fsubr_native_elisp_p(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fsubr_native_lambda_list(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fsubr_type(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fsubrp(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fsubst_char_in_region(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
        arg4: Lisp_Object,
        arg5: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fsubstitute_in_file_name(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fsubstring(arg1: Lisp_Object, arg2: Lisp_Object, arg3: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fsubstring_no_properties(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fsuspend_emacs(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fsuspend_tty(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fsuspicious_object(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fsxhash_eq(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fsxhash_eql(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fsxhash_equal(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fsymbol_function(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fsymbol_name(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fsymbol_plist(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fsymbol_value(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fsymbolp(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fsyntax_table() -> Lisp_Object;
}
extern "C" {
    pub fn Fsyntax_table_p(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fsystem_groups() -> Lisp_Object;
}
extern "C" {
    pub fn Fsystem_name() -> Lisp_Object;
}
extern "C" {
    pub fn Fsystem_users() -> Lisp_Object;
}
extern "C" {
    pub fn Ftab_bar_height(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Ftan(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fterminal_coding_system(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fterminal_list() -> Lisp_Object;
}
extern "C" {
    pub fn Fterminal_live_p(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fterminal_name(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fterminal_parameter(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fterminal_parameters(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fterpri(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Ftest_completion(arg1: Lisp_Object, arg2: Lisp_Object, arg3: Lisp_Object)
        -> Lisp_Object;
}
extern "C" {
    pub fn Ftext_char_description(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Ftext_properties_at(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Ftext_property_any(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
        arg4: Lisp_Object,
        arg5: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Ftext_property_not_all(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
        arg4: Lisp_Object,
        arg5: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Ftext_quoting_style() -> Lisp_Object;
}
extern "C" {
    pub fn Fthis_command_keys() -> Lisp_Object;
}
extern "C" {
    pub fn Fthis_command_keys_vector() -> Lisp_Object;
}
extern "C" {
    pub fn Fthis_single_command_keys() -> Lisp_Object;
}
extern "C" {
    pub fn Fthis_single_command_raw_keys() -> Lisp_Object;
}
extern "C" {
    pub fn Fthread_blocker(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fthread_join(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fthread_last_error(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fthread_live_p(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fthread_name(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fthread_signal(arg1: Lisp_Object, arg2: Lisp_Object, arg3: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fthread_yield() -> Lisp_Object;
}
extern "C" {
    pub fn Fthreadp(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fthrow(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Ftime_add(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Ftime_convert(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Ftime_equal_p(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Ftime_less_p(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Ftime_subtract(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Ftimes(arg1: isize, arg2: *mut Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Ftool_bar_height(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Ftool_bar_pixel_width(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Ftop_level() -> Lisp_Object;
}
extern "C" {
    pub fn Ftrace_redisplay(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Ftrace_to_stderr(arg1: isize, arg2: *mut Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Ftranslate_region_internal(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Ftranspose_regions(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
        arg4: Lisp_Object,
        arg5: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Ftruncate(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Ftry_completion(arg1: Lisp_Object, arg2: Lisp_Object, arg3: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Ftty_display_color_cells(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Ftty_display_color_p(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Ftty_no_underline(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Ftty_suppress_bold_inverse_default_colors(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Ftty_top_frame(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Ftty_type(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Ftype_of(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fundo_boundary() -> Lisp_Object;
}
extern "C" {
    pub fn Funencodable_char_position(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
        arg4: Lisp_Object,
        arg5: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Funhandled_file_name_directory(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Funibyte_char_to_multibyte(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Funibyte_string(arg1: isize, arg2: *mut Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Funicode_property_table_internal(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Funify_charset(arg1: Lisp_Object, arg2: Lisp_Object, arg3: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Funintern(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Funix_sync() -> Lisp_Object;
}
extern "C" {
    pub fn Funlock_buffer() -> Lisp_Object;
}
extern "C" {
    pub fn Funwind_protect(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fupcase(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fupcase_initials(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fupcase_initials_region(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fupcase_region(arg1: Lisp_Object, arg2: Lisp_Object, arg3: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fupcase_word(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fuse_global_map(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fuse_local_map(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fuser_full_name(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fuser_login_name(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fuser_ptrp(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fuser_real_login_name() -> Lisp_Object;
}
extern "C" {
    pub fn Fuser_real_uid() -> Lisp_Object;
}
extern "C" {
    pub fn Fuser_uid() -> Lisp_Object;
}
extern "C" {
    pub fn Fvariable_binding_locus(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fvconcat(arg1: isize, arg2: *mut Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fvector(arg1: isize, arg2: *mut Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fvector_or_char_table_p(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fvectorp(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fverify_visited_file_modtime(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fvertical_motion(arg1: Lisp_Object, arg2: Lisp_Object, arg3: Lisp_Object)
        -> Lisp_Object;
}
extern "C" {
    pub fn Fvisible_frame_list() -> Lisp_Object;
}
extern "C" {
    pub fn Fvisited_file_modtime() -> Lisp_Object;
}
extern "C" {
    pub fn Fwaiting_for_user_input_p() -> Lisp_Object;
}
extern "C" {
    pub fn Fwhere_is_internal(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
        arg4: Lisp_Object,
        arg5: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fwhile(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fwiden() -> Lisp_Object;
}
extern "C" {
    pub fn Fwidget_apply(arg1: isize, arg2: *mut Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fwidget_get(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fwidget_put(arg1: Lisp_Object, arg2: Lisp_Object, arg3: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fwindow_at(arg1: Lisp_Object, arg2: Lisp_Object, arg3: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fwindow_body_height(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fwindow_body_width(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fwindow_bottom_divider_width(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fwindow_buffer(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fwindow_bump_use_time(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fwindow_combination_limit(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fwindow_configuration_frame(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fwindow_configuration_p(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fwindow_dedicated_p(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fwindow_display_table(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fwindow_end(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fwindow_frame(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fwindow_fringes(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fwindow_header_line_height(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fwindow_hscroll(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fwindow_left_child(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fwindow_left_column(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fwindow_line_height(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fwindow_lines_pixel_dimensions(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
        arg4: Lisp_Object,
        arg5: Lisp_Object,
        arg6: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fwindow_list(arg1: Lisp_Object, arg2: Lisp_Object, arg3: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fwindow_list_1(arg1: Lisp_Object, arg2: Lisp_Object, arg3: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fwindow_live_p(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fwindow_margins(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fwindow_minibuffer_p(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fwindow_mode_line_height(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fwindow_new_normal(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fwindow_new_pixel(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fwindow_new_total(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fwindow_next_buffers(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fwindow_next_sibling(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fwindow_normal_size(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fwindow_old_body_pixel_height(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fwindow_old_body_pixel_width(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fwindow_old_buffer(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fwindow_old_pixel_height(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fwindow_old_pixel_width(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fwindow_old_point(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fwindow_parameter(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fwindow_parameters(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fwindow_parent(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fwindow_pixel_height(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fwindow_pixel_left(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fwindow_pixel_top(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fwindow_pixel_width(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fwindow_point(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fwindow_prev_buffers(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fwindow_prev_sibling(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fwindow_redisplay_end_trigger(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fwindow_resize_apply(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fwindow_resize_apply_total(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fwindow_right_divider_width(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fwindow_scroll_bar_height(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fwindow_scroll_bar_width(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fwindow_scroll_bars(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fwindow_start(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fwindow_system(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fwindow_tab_line_height(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fwindow_text_height(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fwindow_text_pixel_size(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
        arg4: Lisp_Object,
        arg5: Lisp_Object,
        arg6: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fwindow_text_width(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fwindow_top_child(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fwindow_top_line(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fwindow_total_height(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fwindow_total_width(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fwindow_use_time(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fwindow_valid_p(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fwindow_vscroll(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fwindowp(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fwrite_char(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fwrite_region(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
        arg4: Lisp_Object,
        arg5: Lisp_Object,
        arg6: Lisp_Object,
        arg7: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fx_change_window_property(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
        arg4: Lisp_Object,
        arg5: Lisp_Object,
        arg6: Lisp_Object,
        arg7: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fx_create_frame(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fx_display_color_cells(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fx_display_grayscale_p(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fx_display_monitor_attributes_list(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fx_display_pixel_height(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fx_display_pixel_width(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fx_display_planes(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fx_display_visual_class(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fx_family_fonts(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fx_focus_frame(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fx_get_resource(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
        arg4: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fx_get_selection_internal(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
        arg4: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fx_hide_tip() -> Lisp_Object;
}
extern "C" {
    pub fn Fx_list_fonts(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
        arg4: Lisp_Object,
        arg5: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fx_load_color_file(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fx_open_connection(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fx_own_selection_internal(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn Fx_parse_geometry(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fx_popup_dialog(arg1: Lisp_Object, arg2: Lisp_Object, arg3: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fx_popup_menu(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fx_register_dnd_atom(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fx_wm_set_size_hint(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fxw_color_values(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fxw_display_color_p(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fyes_or_no_p(arg1: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn Fzlib_available_p() -> Lisp_Object;
}
extern "C" {
    pub fn Fzlib_decompress_region(
        arg1: Lisp_Object,
        arg2: Lisp_Object,
        arg3: Lisp_Object,
    ) -> Lisp_Object;
}
#[repr(C)]
#[repr(align(8))]
#[derive(Copy, Clone)]
pub union vectorlike_header {
    pub size: isize,
    _bindgen_union_align: u64,
}
#[test]
fn bindgen_test_layout_vectorlike_header() {
    assert_eq!(
        ::std::mem::size_of::<vectorlike_header>(),
        8usize,
        concat!("Size of: ", stringify!(vectorlike_header))
    );
    assert_eq!(
        ::std::mem::align_of::<vectorlike_header>(),
        8usize,
        concat!("Alignment of ", stringify!(vectorlike_header))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<vectorlike_header>())).size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(vectorlike_header),
            "::",
            stringify!(size)
        )
    );
}
impl Default for vectorlike_header {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
extern "C" {
    pub fn SYMBOLP(x: Lisp_Object) -> bool;
}
extern "C" {
    pub fn XSYMBOL(a: Lisp_Object) -> *mut Lisp_Symbol;
}
extern "C" {
    pub fn make_lisp_symbol(sym: *mut Lisp_Symbol) -> Lisp_Object;
}
extern "C" {
    pub fn builtin_lisp_symbol(index: ::libc::c_int) -> Lisp_Object;
}
extern "C" {
    pub fn c_symbol_p(sym: *mut Lisp_Symbol) -> bool;
}
extern "C" {
    pub fn CHECK_SYMBOL(x: Lisp_Object);
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum pvec_type {
    PVEC_NORMAL_VECTOR = 0,
    PVEC_FREE = 1,
    PVEC_BIGNUM = 2,
    PVEC_MARKER = 3,
    PVEC_OVERLAY = 4,
    PVEC_FINALIZER = 5,
    PVEC_MISC_PTR = 6,
    PVEC_USER_PTR = 7,
    PVEC_PROCESS = 8,
    PVEC_FRAME = 9,
    PVEC_WINDOW = 10,
    PVEC_BOOL_VECTOR = 11,
    PVEC_BUFFER = 12,
    PVEC_HASH_TABLE = 13,
    PVEC_TERMINAL = 14,
    PVEC_WINDOW_CONFIGURATION = 15,
    PVEC_SUBR = 16,
    PVEC_OTHER = 17,
    PVEC_XWIDGET = 18,
    PVEC_XWIDGET_VIEW = 19,
    PVEC_THREAD = 20,
    PVEC_MUTEX = 21,
    PVEC_CONDVAR = 22,
    PVEC_MODULE_FUNCTION = 23,
    PVEC_NATIVE_COMP_UNIT = 24,
    PVEC_COMPILED = 25,
    PVEC_CHAR_TABLE = 26,
    PVEC_SUB_CHAR_TABLE = 27,
    PVEC_RECORD = 28,
    PVEC_FONT = 29,
}
pub mod More_Lisp_Bits {
    pub type Type = u32;
    pub const PSEUDOVECTOR_SIZE_BITS: Type = 12;
    pub const PSEUDOVECTOR_SIZE_MASK: Type = 4095;
    pub const PSEUDOVECTOR_REST_BITS: Type = 12;
    pub const PSEUDOVECTOR_REST_MASK: Type = 16773120;
    pub const PSEUDOVECTOR_AREA_BITS: Type = 24;
    pub const PVEC_TYPE_MASK: Type = 1056964608;
}
extern "C" {
    pub fn make_fixnum(n: EMACS_INT) -> Lisp_Object;
}
extern "C" {
    pub fn XFIXNUM_RAW(a: Lisp_Object) -> EMACS_INT;
}
extern "C" {
    pub fn make_ufixnum(n: EMACS_INT) -> Lisp_Object;
}
extern "C" {
    pub fn FIXNUMP(x: Lisp_Object) -> bool;
}
extern "C" {
    pub fn XFIXNUM(a: Lisp_Object) -> EMACS_INT;
}
extern "C" {
    pub fn XUFIXNUM_RAW(a: Lisp_Object) -> EMACS_UINT;
}
extern "C" {
    pub fn XUFIXNUM(a: Lisp_Object) -> EMACS_UINT;
}
extern "C" {
    pub fn XHASH(a: Lisp_Object) -> EMACS_INT;
}
extern "C" {
    pub fn make_fixed_natnum(n: EMACS_INT) -> Lisp_Object;
}
extern "C" {
    pub fn EQ(x: Lisp_Object, y: Lisp_Object) -> bool;
}
extern "C" {
    pub fn clip_to_bounds(lower: intmax_t, num: intmax_t, upper: intmax_t) -> intmax_t;
}
extern "C" {
    pub fn make_lisp_ptr(ptr: *mut ::libc::c_void, type_: Lisp_Type) -> Lisp_Object;
}
extern "C" {
    pub fn dead_object() -> Lisp_Object;
}
extern "C" {
    pub fn XFIXNUMPTR(a: Lisp_Object) -> *mut ::libc::c_void;
}
extern "C" {
    pub fn make_pointer_integer_unsafe(p: *mut ::libc::c_void) -> Lisp_Object;
}
extern "C" {
    pub fn make_pointer_integer(p: *mut ::libc::c_void) -> Lisp_Object;
}
pub type INTERVAL = *mut interval;
#[repr(C)]
pub struct Lisp_Cons {
    pub u: Lisp_Cons__bindgen_ty_1,
}
#[repr(C)]
#[repr(align(8))]
pub struct Lisp_Cons__bindgen_ty_1 {
    pub s: __BindgenUnionField<Lisp_Cons__bindgen_ty_1__bindgen_ty_1>,
    pub gcaligned: __BindgenUnionField<::libc::c_char>,
    pub bindgen_union_field: [u64; 2usize],
}
#[repr(C)]
pub struct Lisp_Cons__bindgen_ty_1__bindgen_ty_1 {
    pub car: Lisp_Object,
    pub u: Lisp_Cons__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1,
}
#[repr(C)]
#[repr(align(8))]
pub union Lisp_Cons__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1 {
    pub cdr: Lisp_Object,
    pub chain: *mut Lisp_Cons,
    _bindgen_union_align: u64,
}
#[test]
fn bindgen_test_layout_Lisp_Cons__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<Lisp_Cons__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(Lisp_Cons__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<Lisp_Cons__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(Lisp_Cons__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Lisp_Cons__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1>())).cdr
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Lisp_Cons__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(cdr)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Lisp_Cons__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1>())).chain
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Lisp_Cons__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(chain)
        )
    );
}
impl Default for Lisp_Cons__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1 {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[test]
fn bindgen_test_layout_Lisp_Cons__bindgen_ty_1__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<Lisp_Cons__bindgen_ty_1__bindgen_ty_1>(),
        16usize,
        concat!(
            "Size of: ",
            stringify!(Lisp_Cons__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<Lisp_Cons__bindgen_ty_1__bindgen_ty_1>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(Lisp_Cons__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Lisp_Cons__bindgen_ty_1__bindgen_ty_1>())).car as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Lisp_Cons__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(car)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Lisp_Cons__bindgen_ty_1__bindgen_ty_1>())).u as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Lisp_Cons__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(u)
        )
    );
}
impl Default for Lisp_Cons__bindgen_ty_1__bindgen_ty_1 {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[test]
fn bindgen_test_layout_Lisp_Cons__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<Lisp_Cons__bindgen_ty_1>(),
        16usize,
        concat!("Size of: ", stringify!(Lisp_Cons__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<Lisp_Cons__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(Lisp_Cons__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Lisp_Cons__bindgen_ty_1>())).s as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Lisp_Cons__bindgen_ty_1),
            "::",
            stringify!(s)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Lisp_Cons__bindgen_ty_1>())).gcaligned as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Lisp_Cons__bindgen_ty_1),
            "::",
            stringify!(gcaligned)
        )
    );
}
impl Default for Lisp_Cons__bindgen_ty_1 {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[test]
fn bindgen_test_layout_Lisp_Cons() {
    assert_eq!(
        ::std::mem::size_of::<Lisp_Cons>(),
        16usize,
        concat!("Size of: ", stringify!(Lisp_Cons))
    );
    assert_eq!(
        ::std::mem::align_of::<Lisp_Cons>(),
        8usize,
        concat!("Alignment of ", stringify!(Lisp_Cons))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Lisp_Cons>())).u as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Lisp_Cons),
            "::",
            stringify!(u)
        )
    );
}
impl Default for Lisp_Cons {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
extern "C" {
    pub fn NILP(x: Lisp_Object) -> bool;
}
extern "C" {
    pub fn CONSP(x: Lisp_Object) -> bool;
}
extern "C" {
    pub fn CHECK_CONS(x: Lisp_Object);
}
extern "C" {
    pub fn XCONS(a: Lisp_Object) -> *mut Lisp_Cons;
}
extern "C" {
    pub fn xcar_addr(c: Lisp_Object) -> *mut Lisp_Object;
}
extern "C" {
    pub fn xcdr_addr(c: Lisp_Object) -> *mut Lisp_Object;
}
extern "C" {
    pub fn XCAR(c: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn XCDR(c: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn XSETCAR(c: Lisp_Object, n: Lisp_Object);
}
extern "C" {
    pub fn XSETCDR(c: Lisp_Object, n: Lisp_Object);
}
extern "C" {
    pub fn CAR(c: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn CDR(c: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn CAR_SAFE(c: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn CDR_SAFE(c: Lisp_Object) -> Lisp_Object;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct Lisp_String {
    pub u: Lisp_String__bindgen_ty_1,
}
#[repr(C)]
#[repr(align(8))]
#[derive(Copy, Clone)]
pub union Lisp_String__bindgen_ty_1 {
    pub s: Lisp_String__bindgen_ty_1__bindgen_ty_1,
    pub next: *mut Lisp_String,
    pub gcaligned: ::libc::c_char,
    _bindgen_union_align: [u64; 4usize],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Lisp_String__bindgen_ty_1__bindgen_ty_1 {
    pub size: isize,
    pub size_byte: isize,
    pub intervals: INTERVAL,
    pub data: *mut ::libc::c_uchar,
}
#[test]
fn bindgen_test_layout_Lisp_String__bindgen_ty_1__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<Lisp_String__bindgen_ty_1__bindgen_ty_1>(),
        32usize,
        concat!(
            "Size of: ",
            stringify!(Lisp_String__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<Lisp_String__bindgen_ty_1__bindgen_ty_1>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(Lisp_String__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Lisp_String__bindgen_ty_1__bindgen_ty_1>())).size as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Lisp_String__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Lisp_String__bindgen_ty_1__bindgen_ty_1>())).size_byte
                as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Lisp_String__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(size_byte)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Lisp_String__bindgen_ty_1__bindgen_ty_1>())).intervals
                as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(Lisp_String__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(intervals)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Lisp_String__bindgen_ty_1__bindgen_ty_1>())).data as *const _
                as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(Lisp_String__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(data)
        )
    );
}
impl Default for Lisp_String__bindgen_ty_1__bindgen_ty_1 {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[test]
fn bindgen_test_layout_Lisp_String__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<Lisp_String__bindgen_ty_1>(),
        32usize,
        concat!("Size of: ", stringify!(Lisp_String__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<Lisp_String__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(Lisp_String__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Lisp_String__bindgen_ty_1>())).s as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Lisp_String__bindgen_ty_1),
            "::",
            stringify!(s)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Lisp_String__bindgen_ty_1>())).next as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Lisp_String__bindgen_ty_1),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Lisp_String__bindgen_ty_1>())).gcaligned as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Lisp_String__bindgen_ty_1),
            "::",
            stringify!(gcaligned)
        )
    );
}
impl Default for Lisp_String__bindgen_ty_1 {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[test]
fn bindgen_test_layout_Lisp_String() {
    assert_eq!(
        ::std::mem::size_of::<Lisp_String>(),
        32usize,
        concat!("Size of: ", stringify!(Lisp_String))
    );
    assert_eq!(
        ::std::mem::align_of::<Lisp_String>(),
        8usize,
        concat!("Alignment of ", stringify!(Lisp_String))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Lisp_String>())).u as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Lisp_String),
            "::",
            stringify!(u)
        )
    );
}
impl Default for Lisp_String {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
extern "C" {
    pub fn STRINGP(x: Lisp_Object) -> bool;
}
extern "C" {
    pub fn CHECK_STRING(x: Lisp_Object);
}
extern "C" {
    pub fn XSTRING(a: Lisp_Object) -> *mut Lisp_String;
}
extern "C" {
    pub fn STRING_MULTIBYTE(str: Lisp_Object) -> bool;
}
extern "C" {
    pub fn SDATA(string: Lisp_Object) -> *mut ::libc::c_uchar;
}
extern "C" {
    pub fn SSDATA(string: Lisp_Object) -> *mut ::libc::c_char;
}
extern "C" {
    pub fn SREF(string: Lisp_Object, index: isize) -> ::libc::c_uchar;
}
extern "C" {
    pub fn SSET(string: Lisp_Object, index: isize, new: ::libc::c_uchar);
}
extern "C" {
    pub fn SCHARS(string: Lisp_Object) -> isize;
}
extern "C" {
    pub fn STRING_BYTES(s: *mut Lisp_String) -> isize;
}
extern "C" {
    pub fn SBYTES(string: Lisp_Object) -> isize;
}
extern "C" {
    pub fn STRING_SET_CHARS(string: Lisp_Object, newsize: isize);
}
#[repr(C)]
pub struct Lisp_Vector {
    pub header: vectorlike_header,
    pub contents: __IncompleteArrayField<Lisp_Object>,
}
#[test]
fn bindgen_test_layout_Lisp_Vector() {
    assert_eq!(
        ::std::mem::size_of::<Lisp_Vector>(),
        8usize,
        concat!("Size of: ", stringify!(Lisp_Vector))
    );
    assert_eq!(
        ::std::mem::align_of::<Lisp_Vector>(),
        8usize,
        concat!("Alignment of ", stringify!(Lisp_Vector))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Lisp_Vector>())).header as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Lisp_Vector),
            "::",
            stringify!(header)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Lisp_Vector>())).contents as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Lisp_Vector),
            "::",
            stringify!(contents)
        )
    );
}
impl Default for Lisp_Vector {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
extern "C" {
    pub fn VECTORLIKEP(x: Lisp_Object) -> bool;
}
extern "C" {
    pub fn XVECTOR(a: Lisp_Object) -> *mut Lisp_Vector;
}
extern "C" {
    pub fn ASIZE(array: Lisp_Object) -> isize;
}
extern "C" {
    pub fn gc_asize(array: Lisp_Object) -> isize;
}
extern "C" {
    pub fn PVSIZE(pv: Lisp_Object) -> isize;
}
extern "C" {
    pub fn VECTORP(x: Lisp_Object) -> bool;
}
extern "C" {
    pub fn CHECK_VECTOR(x: Lisp_Object);
}
extern "C" {
    pub fn PSEUDOVECTOR_TYPE(v: *const Lisp_Vector) -> pvec_type;
}
extern "C" {
    pub fn PSEUDOVECTOR_TYPEP(a: *const vectorlike_header, code: pvec_type) -> bool;
}
extern "C" {
    pub fn PSEUDOVECTORP(a: Lisp_Object, code: ::libc::c_int) -> bool;
}
#[repr(C)]
pub struct Lisp_Bool_Vector {
    pub header: vectorlike_header,
    pub size: EMACS_INT,
    pub data: __IncompleteArrayField<bits_word>,
}
#[test]
fn bindgen_test_layout_Lisp_Bool_Vector() {
    assert_eq!(
        ::std::mem::size_of::<Lisp_Bool_Vector>(),
        16usize,
        concat!("Size of: ", stringify!(Lisp_Bool_Vector))
    );
    assert_eq!(
        ::std::mem::align_of::<Lisp_Bool_Vector>(),
        8usize,
        concat!("Alignment of ", stringify!(Lisp_Bool_Vector))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Lisp_Bool_Vector>())).header as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Lisp_Bool_Vector),
            "::",
            stringify!(header)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Lisp_Bool_Vector>())).size as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Lisp_Bool_Vector),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Lisp_Bool_Vector>())).data as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(Lisp_Bool_Vector),
            "::",
            stringify!(data)
        )
    );
}
impl Default for Lisp_Bool_Vector {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
pub mod _bindgen_ty_4 {
    pub type Type = u32;
    pub const header_size: Type = 8;
    pub const bool_header_size: Type = 16;
    pub const word_size: Type = 8;
}
extern "C" {
    pub fn bool_vector_words(size: EMACS_INT) -> EMACS_INT;
}
extern "C" {
    pub fn bool_vector_bytes(size: EMACS_INT) -> EMACS_INT;
}
extern "C" {
    pub fn BOOL_VECTOR_P(a: Lisp_Object) -> bool;
}
extern "C" {
    pub fn CHECK_BOOL_VECTOR(x: Lisp_Object);
}
extern "C" {
    pub fn XBOOL_VECTOR(a: Lisp_Object) -> *mut Lisp_Bool_Vector;
}
extern "C" {
    pub fn bool_vector_size(a: Lisp_Object) -> EMACS_INT;
}
extern "C" {
    pub fn bool_vector_data(a: Lisp_Object) -> *mut bits_word;
}
extern "C" {
    pub fn bool_vector_uchar_data(a: Lisp_Object) -> *mut ::libc::c_uchar;
}
extern "C" {
    pub fn bool_vector_bitref(a: Lisp_Object, i: EMACS_INT) -> bool;
}
extern "C" {
    pub fn bool_vector_ref(a: Lisp_Object, i: EMACS_INT) -> Lisp_Object;
}
extern "C" {
    pub fn bool_vector_set(a: Lisp_Object, i: EMACS_INT, b: bool);
}
extern "C" {
    pub fn AREF(array: Lisp_Object, idx: isize) -> Lisp_Object;
}
extern "C" {
    pub fn aref_addr(array: Lisp_Object, idx: isize) -> *mut Lisp_Object;
}
extern "C" {
    pub fn ASET(array: Lisp_Object, idx: isize, val: Lisp_Object);
}
extern "C" {
    pub fn gc_aset(array: Lisp_Object, idx: isize, val: Lisp_Object);
}
pub mod _bindgen_ty_5 {
    pub type Type = u32;
    pub const NIL_IS_ZERO: Type = 1;
}
extern "C" {
    pub fn memclear(p: *mut ::libc::c_void, nbytes: isize);
}
extern "C" {
    pub fn ASCII_CHAR_P(c: intmax_t) -> bool;
}
pub mod CHARTAB_SIZE_BITS {
    pub type Type = u32;
    pub const CHARTAB_SIZE_BITS_0: Type = 6;
    pub const CHARTAB_SIZE_BITS_1: Type = 4;
    pub const CHARTAB_SIZE_BITS_2: Type = 5;
    pub const CHARTAB_SIZE_BITS_3: Type = 7;
}
extern "C" {
    #[link_name = "\u{1}chartab_size"]
    pub static mut chartab_size: [::libc::c_int; 4usize];
}
#[repr(C)]
pub struct Lisp_Char_Table {
    pub header: vectorlike_header,
    pub defalt: Lisp_Object,
    pub parent: Lisp_Object,
    pub purpose: Lisp_Object,
    pub ascii: Lisp_Object,
    pub contents: [Lisp_Object; 64usize],
    pub extras: __IncompleteArrayField<Lisp_Object>,
}
#[test]
fn bindgen_test_layout_Lisp_Char_Table() {
    assert_eq!(
        ::std::mem::size_of::<Lisp_Char_Table>(),
        552usize,
        concat!("Size of: ", stringify!(Lisp_Char_Table))
    );
    assert_eq!(
        ::std::mem::align_of::<Lisp_Char_Table>(),
        8usize,
        concat!("Alignment of ", stringify!(Lisp_Char_Table))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Lisp_Char_Table>())).header as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Lisp_Char_Table),
            "::",
            stringify!(header)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Lisp_Char_Table>())).defalt as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Lisp_Char_Table),
            "::",
            stringify!(defalt)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Lisp_Char_Table>())).parent as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(Lisp_Char_Table),
            "::",
            stringify!(parent)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Lisp_Char_Table>())).purpose as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(Lisp_Char_Table),
            "::",
            stringify!(purpose)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Lisp_Char_Table>())).ascii as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(Lisp_Char_Table),
            "::",
            stringify!(ascii)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Lisp_Char_Table>())).contents as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(Lisp_Char_Table),
            "::",
            stringify!(contents)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Lisp_Char_Table>())).extras as *const _ as usize },
        552usize,
        concat!(
            "Offset of field: ",
            stringify!(Lisp_Char_Table),
            "::",
            stringify!(extras)
        )
    );
}
impl Default for Lisp_Char_Table {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
extern "C" {
    pub fn CHAR_TABLE_P(a: Lisp_Object) -> bool;
}
extern "C" {
    pub fn XCHAR_TABLE(a: Lisp_Object) -> *mut Lisp_Char_Table;
}
#[repr(C)]
pub struct Lisp_Sub_Char_Table {
    pub header: vectorlike_header,
    pub depth: ::libc::c_int,
    pub min_char: ::libc::c_int,
    pub contents: __IncompleteArrayField<Lisp_Object>,
}
#[test]
fn bindgen_test_layout_Lisp_Sub_Char_Table() {
    assert_eq!(
        ::std::mem::size_of::<Lisp_Sub_Char_Table>(),
        16usize,
        concat!("Size of: ", stringify!(Lisp_Sub_Char_Table))
    );
    assert_eq!(
        ::std::mem::align_of::<Lisp_Sub_Char_Table>(),
        8usize,
        concat!("Alignment of ", stringify!(Lisp_Sub_Char_Table))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Lisp_Sub_Char_Table>())).header as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Lisp_Sub_Char_Table),
            "::",
            stringify!(header)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Lisp_Sub_Char_Table>())).depth as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Lisp_Sub_Char_Table),
            "::",
            stringify!(depth)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Lisp_Sub_Char_Table>())).min_char as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(Lisp_Sub_Char_Table),
            "::",
            stringify!(min_char)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Lisp_Sub_Char_Table>())).contents as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(Lisp_Sub_Char_Table),
            "::",
            stringify!(contents)
        )
    );
}
impl Default for Lisp_Sub_Char_Table {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
extern "C" {
    pub fn SUB_CHAR_TABLE_P(a: Lisp_Object) -> bool;
}
extern "C" {
    pub fn XSUB_CHAR_TABLE(a: Lisp_Object) -> *mut Lisp_Sub_Char_Table;
}
extern "C" {
    pub fn CHAR_TABLE_REF_ASCII(ct: Lisp_Object, idx: isize) -> Lisp_Object;
}
extern "C" {
    pub fn CHAR_TABLE_REF(ct: Lisp_Object, idx: ::libc::c_int) -> Lisp_Object;
}
extern "C" {
    pub fn CHAR_TABLE_SET(ct: Lisp_Object, idx: ::libc::c_int, val: Lisp_Object);
}
pub mod _bindgen_ty_6 {
    pub type Type = u32;
    pub const NATIVE_COMP_FLAG: Type = 1;
}
pub type dynlib_handle_ptr = *mut ::libc::c_void;
extern "C" {
    pub fn dynlib_open(path: *const ::libc::c_char) -> dynlib_handle_ptr;
}
extern "C" {
    pub fn dynlib_close(h: dynlib_handle_ptr) -> ::libc::c_int;
}
extern "C" {
    pub fn dynlib_error() -> *const ::libc::c_char;
}
extern "C" {
    pub fn dynlib_sym(h: dynlib_handle_ptr, sym: *const ::libc::c_char) -> *mut ::libc::c_void;
}
pub type dynlib_function_ptr = ::std::option::Option<unsafe extern "C" fn()>;
extern "C" {
    pub fn dynlib_func(h: dynlib_handle_ptr, sym: *const ::libc::c_char) -> dynlib_function_ptr;
}
extern "C" {
    pub fn dynlib_addr(
        ptr: ::std::option::Option<unsafe extern "C" fn()>,
        file: *mut *const ::libc::c_char,
        sym: *mut *const ::libc::c_char,
    );
}
#[repr(C)]
pub struct Lisp_Native_Comp_Unit {
    pub header: vectorlike_header,
    pub file: Lisp_Object,
    pub optimize_qualities: Lisp_Object,
    pub lambda_gc_guard_h: Lisp_Object,
    pub lambda_c_name_idx_h: Lisp_Object,
    pub data_fdoc_v: Lisp_Object,
    pub data_vec: Lisp_Object,
    pub data_impure_vec: Lisp_Object,
    pub data_imp_relocs: *mut Lisp_Object,
    pub loaded_once: bool,
    pub load_ongoing: bool,
    pub handle: dynlib_handle_ptr,
}
#[test]
fn bindgen_test_layout_Lisp_Native_Comp_Unit() {
    assert_eq!(
        ::std::mem::size_of::<Lisp_Native_Comp_Unit>(),
        88usize,
        concat!("Size of: ", stringify!(Lisp_Native_Comp_Unit))
    );
    assert_eq!(
        ::std::mem::align_of::<Lisp_Native_Comp_Unit>(),
        8usize,
        concat!("Alignment of ", stringify!(Lisp_Native_Comp_Unit))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Lisp_Native_Comp_Unit>())).header as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Lisp_Native_Comp_Unit),
            "::",
            stringify!(header)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Lisp_Native_Comp_Unit>())).file as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Lisp_Native_Comp_Unit),
            "::",
            stringify!(file)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Lisp_Native_Comp_Unit>())).optimize_qualities as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(Lisp_Native_Comp_Unit),
            "::",
            stringify!(optimize_qualities)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Lisp_Native_Comp_Unit>())).lambda_gc_guard_h as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(Lisp_Native_Comp_Unit),
            "::",
            stringify!(lambda_gc_guard_h)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Lisp_Native_Comp_Unit>())).lambda_c_name_idx_h as *const _
                as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(Lisp_Native_Comp_Unit),
            "::",
            stringify!(lambda_c_name_idx_h)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Lisp_Native_Comp_Unit>())).data_fdoc_v as *const _ as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(Lisp_Native_Comp_Unit),
            "::",
            stringify!(data_fdoc_v)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Lisp_Native_Comp_Unit>())).data_vec as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(Lisp_Native_Comp_Unit),
            "::",
            stringify!(data_vec)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Lisp_Native_Comp_Unit>())).data_impure_vec as *const _ as usize
        },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(Lisp_Native_Comp_Unit),
            "::",
            stringify!(data_impure_vec)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Lisp_Native_Comp_Unit>())).data_imp_relocs as *const _ as usize
        },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(Lisp_Native_Comp_Unit),
            "::",
            stringify!(data_imp_relocs)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Lisp_Native_Comp_Unit>())).loaded_once as *const _ as usize
        },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(Lisp_Native_Comp_Unit),
            "::",
            stringify!(loaded_once)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Lisp_Native_Comp_Unit>())).load_ongoing as *const _ as usize
        },
        73usize,
        concat!(
            "Offset of field: ",
            stringify!(Lisp_Native_Comp_Unit),
            "::",
            stringify!(load_ongoing)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Lisp_Native_Comp_Unit>())).handle as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(Lisp_Native_Comp_Unit),
            "::",
            stringify!(handle)
        )
    );
}
impl Default for Lisp_Native_Comp_Unit {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
extern "C" {
    pub fn NATIVE_COMP_UNITP(a: Lisp_Object) -> bool;
}
extern "C" {
    pub fn XNATIVE_COMP_UNIT(a: Lisp_Object) -> *mut Lisp_Native_Comp_Unit;
}
extern "C" {
    pub fn hash_native_abi();
}
extern "C" {
    pub fn load_comp_unit(
        comp_u: *mut Lisp_Native_Comp_Unit,
        loading_dump: bool,
        late_load: bool,
    ) -> Lisp_Object;
}
extern "C" {
    pub fn unload_comp_unit(arg1: *mut Lisp_Native_Comp_Unit);
}
extern "C" {
    pub fn native_function_doc(function: Lisp_Object) -> Lisp_Object;
}
extern "C" {
    pub fn syms_of_comp();
}
extern "C" {
    pub fn maybe_defer_native_compilation(function_name: Lisp_Object, definition: Lisp_Object);
}
extern "C" {
    pub fn eln_load_path_final_clean_up();
}
extern "C" {
    pub fn fixup_eln_load_path(directory: Lisp_Object);
}
#[repr(C)]
pub struct Lisp_Subr {
    pub header: vectorlike_header,
    pub function: Lisp_Subr__bindgen_ty_1,
    pub min_args: ::libc::c_short,
    pub max_args: ::libc::c_short,
    pub symbol_name: *const ::libc::c_char,
    pub __bindgen_anon_1: Lisp_Subr__bindgen_ty_2,
    pub doc: EMACS_INT,
    pub native_comp_u: [Lisp_Object; 1usize],
    pub native_c_name: [*mut ::libc::c_char; 1usize],
    pub lambda_list: [Lisp_Object; 1usize],
    pub type_: [Lisp_Object; 1usize],
}
#[repr(C)]
#[repr(align(8))]
#[derive(Copy, Clone)]
pub union Lisp_Subr__bindgen_ty_1 {
    pub a0: ::std::option::Option<unsafe extern "C" fn() -> Lisp_Object>,
    pub a1: ::std::option::Option<unsafe extern "C" fn(arg1: Lisp_Object) -> Lisp_Object>,
    pub a2: ::std::option::Option<
        unsafe extern "C" fn(arg1: Lisp_Object, arg2: Lisp_Object) -> Lisp_Object,
    >,
    pub a3: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: Lisp_Object,
            arg2: Lisp_Object,
            arg3: Lisp_Object,
        ) -> Lisp_Object,
    >,
    pub a4: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: Lisp_Object,
            arg2: Lisp_Object,
            arg3: Lisp_Object,
            arg4: Lisp_Object,
        ) -> Lisp_Object,
    >,
    pub a5: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: Lisp_Object,
            arg2: Lisp_Object,
            arg3: Lisp_Object,
            arg4: Lisp_Object,
            arg5: Lisp_Object,
        ) -> Lisp_Object,
    >,
    pub a6: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: Lisp_Object,
            arg2: Lisp_Object,
            arg3: Lisp_Object,
            arg4: Lisp_Object,
            arg5: Lisp_Object,
            arg6: Lisp_Object,
        ) -> Lisp_Object,
    >,
    pub a7: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: Lisp_Object,
            arg2: Lisp_Object,
            arg3: Lisp_Object,
            arg4: Lisp_Object,
            arg5: Lisp_Object,
            arg6: Lisp_Object,
            arg7: Lisp_Object,
        ) -> Lisp_Object,
    >,
    pub a8: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: Lisp_Object,
            arg2: Lisp_Object,
            arg3: Lisp_Object,
            arg4: Lisp_Object,
            arg5: Lisp_Object,
            arg6: Lisp_Object,
            arg7: Lisp_Object,
            arg8: Lisp_Object,
        ) -> Lisp_Object,
    >,
    pub aUNEVALLED: ::std::option::Option<unsafe extern "C" fn(args: Lisp_Object) -> Lisp_Object>,
    pub aMANY: ::std::option::Option<
        unsafe extern "C" fn(arg1: isize, arg2: *mut Lisp_Object) -> Lisp_Object,
    >,
    _bindgen_union_align: u64,
}
#[test]
fn bindgen_test_layout_Lisp_Subr__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<Lisp_Subr__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(Lisp_Subr__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<Lisp_Subr__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(Lisp_Subr__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Lisp_Subr__bindgen_ty_1>())).a0 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Lisp_Subr__bindgen_ty_1),
            "::",
            stringify!(a0)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Lisp_Subr__bindgen_ty_1>())).a1 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Lisp_Subr__bindgen_ty_1),
            "::",
            stringify!(a1)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Lisp_Subr__bindgen_ty_1>())).a2 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Lisp_Subr__bindgen_ty_1),
            "::",
            stringify!(a2)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Lisp_Subr__bindgen_ty_1>())).a3 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Lisp_Subr__bindgen_ty_1),
            "::",
            stringify!(a3)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Lisp_Subr__bindgen_ty_1>())).a4 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Lisp_Subr__bindgen_ty_1),
            "::",
            stringify!(a4)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Lisp_Subr__bindgen_ty_1>())).a5 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Lisp_Subr__bindgen_ty_1),
            "::",
            stringify!(a5)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Lisp_Subr__bindgen_ty_1>())).a6 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Lisp_Subr__bindgen_ty_1),
            "::",
            stringify!(a6)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Lisp_Subr__bindgen_ty_1>())).a7 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Lisp_Subr__bindgen_ty_1),
            "::",
            stringify!(a7)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Lisp_Subr__bindgen_ty_1>())).a8 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Lisp_Subr__bindgen_ty_1),
            "::",
            stringify!(a8)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Lisp_Subr__bindgen_ty_1>())).aUNEVALLED as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Lisp_Subr__bindgen_ty_1),
            "::",
            stringify!(aUNEVALLED)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Lisp_Subr__bindgen_ty_1>())).aMANY as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Lisp_Subr__bindgen_ty_1),
            "::",
            stringify!(aMANY)
        )
    );
}
impl Default for Lisp_Subr__bindgen_ty_1 {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[repr(C)]
#[repr(align(8))]
pub union Lisp_Subr__bindgen_ty_2 {
    pub intspec: *const ::libc::c_char,
    pub native_intspec: Lisp_Object,
    _bindgen_union_align: u64,
}
#[test]
fn bindgen_test_layout_Lisp_Subr__bindgen_ty_2() {
    assert_eq!(
        ::std::mem::size_of::<Lisp_Subr__bindgen_ty_2>(),
        8usize,
        concat!("Size of: ", stringify!(Lisp_Subr__bindgen_ty_2))
    );
    assert_eq!(
        ::std::mem::align_of::<Lisp_Subr__bindgen_ty_2>(),
        8usize,
        concat!("Alignment of ", stringify!(Lisp_Subr__bindgen_ty_2))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Lisp_Subr__bindgen_ty_2>())).intspec as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Lisp_Subr__bindgen_ty_2),
            "::",
            stringify!(intspec)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Lisp_Subr__bindgen_ty_2>())).native_intspec as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Lisp_Subr__bindgen_ty_2),
            "::",
            stringify!(native_intspec)
        )
    );
}
impl Default for Lisp_Subr__bindgen_ty_2 {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[test]
fn bindgen_test_layout_Lisp_Subr() {
    assert_eq!(
        ::std::mem::size_of::<Lisp_Subr>(),
        80usize,
        concat!("Size of: ", stringify!(Lisp_Subr))
    );
    assert_eq!(
        ::std::mem::align_of::<Lisp_Subr>(),
        8usize,
        concat!("Alignment of ", stringify!(Lisp_Subr))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Lisp_Subr>())).header as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Lisp_Subr),
            "::",
            stringify!(header)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Lisp_Subr>())).function as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Lisp_Subr),
            "::",
            stringify!(function)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Lisp_Subr>())).min_args as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(Lisp_Subr),
            "::",
            stringify!(min_args)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Lisp_Subr>())).max_args as *const _ as usize },
        18usize,
        concat!(
            "Offset of field: ",
            stringify!(Lisp_Subr),
            "::",
            stringify!(max_args)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Lisp_Subr>())).symbol_name as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(Lisp_Subr),
            "::",
            stringify!(symbol_name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Lisp_Subr>())).doc as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(Lisp_Subr),
            "::",
            stringify!(doc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Lisp_Subr>())).native_comp_u as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(Lisp_Subr),
            "::",
            stringify!(native_comp_u)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Lisp_Subr>())).native_c_name as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(Lisp_Subr),
            "::",
            stringify!(native_c_name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Lisp_Subr>())).lambda_list as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(Lisp_Subr),
            "::",
            stringify!(lambda_list)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Lisp_Subr>())).type_ as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(Lisp_Subr),
            "::",
            stringify!(type_)
        )
    );
}
impl Default for Lisp_Subr {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[repr(C)]
#[repr(align(8))]
pub struct Aligned_Lisp_Subr {
    pub s: __BindgenUnionField<Lisp_Subr>,
    pub gcaligned: __BindgenUnionField<::libc::c_char>,
    pub bindgen_union_field: [u64; 10usize],
}
#[test]
fn bindgen_test_layout_Aligned_Lisp_Subr() {
    assert_eq!(
        ::std::mem::size_of::<Aligned_Lisp_Subr>(),
        80usize,
        concat!("Size of: ", stringify!(Aligned_Lisp_Subr))
    );
    assert_eq!(
        ::std::mem::align_of::<Aligned_Lisp_Subr>(),
        8usize,
        concat!("Alignment of ", stringify!(Aligned_Lisp_Subr))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Aligned_Lisp_Subr>())).s as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Aligned_Lisp_Subr),
            "::",
            stringify!(s)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Aligned_Lisp_Subr>())).gcaligned as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Aligned_Lisp_Subr),
            "::",
            stringify!(gcaligned)
        )
    );
}
impl Default for Aligned_Lisp_Subr {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
extern "C" {
    pub fn SUBRP(a: Lisp_Object) -> bool;
}
extern "C" {
    pub fn XSUBR(a: Lisp_Object) -> *mut Lisp_Subr;
}
pub mod char_table_specials {
    pub type Type = u32;
    pub const CHAR_TABLE_STANDARD_SLOTS: Type = 68;
    pub const SUB_CHAR_TABLE_OFFSET: Type = 1;
}
extern "C" {
    pub fn CHAR_TABLE_EXTRA_SLOTS(ct: *mut Lisp_Char_Table) -> ::libc::c_int;
}
pub type sys_jmp_buf = jmp_buf;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct re_registers {
    pub num_regs: isize,
    pub start: *mut isize,
    pub end: *mut isize,
}
#[test]
fn bindgen_test_layout_re_registers() {
    assert_eq!(
        ::std::mem::size_of::<re_registers>(),
        24usize,
        concat!("Size of: ", stringify!(re_registers))
    );
    assert_eq!(
        ::std::mem::align_of::<re_registers>(),
        8usize,
        concat!("Alignment of ", stringify!(re_registers))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<re_registers>())).num_regs as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(re_registers),
            "::",
            stringify!(num_regs)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<re_registers>())).start as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(re_registers),
            "::",
            stringify!(start)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<re_registers>())).end as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(re_registers),
            "::",
            stringify!(end)
        )
    );
}
impl Default for re_registers {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
extern "C" {
    #[link_name = "\u{1}re_match_object"]
    pub static mut re_match_object: Lisp_Object;
}
extern "C" {
    #[link_name = "\u{1}emacs_re_max_failures"]
    pub static mut emacs_re_max_failures: isize;
}
extern "C" {
    #[link_name = "\u{1}emacs_re_safe_alloca"]
    pub static mut emacs_re_safe_alloca: isize;
}
#[repr(C)]
pub struct re_pattern_buffer {
    pub buffer: *mut ::libc::c_uchar,
    pub allocated: isize,
    pub used: isize,
    pub charset_unibyte: ::libc::c_int,
    pub fastmap: *mut ::libc::c_char,
    pub translate: Lisp_Object,
    pub re_nsub: isize,
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize], u8>,
    pub __bindgen_padding_0: [u8; 7usize],
}
#[test]
fn bindgen_test_layout_re_pattern_buffer() {
    assert_eq!(
        ::std::mem::size_of::<re_pattern_buffer>(),
        64usize,
        concat!("Size of: ", stringify!(re_pattern_buffer))
    );
    assert_eq!(
        ::std::mem::align_of::<re_pattern_buffer>(),
        8usize,
        concat!("Alignment of ", stringify!(re_pattern_buffer))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<re_pattern_buffer>())).buffer as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(re_pattern_buffer),
            "::",
            stringify!(buffer)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<re_pattern_buffer>())).allocated as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(re_pattern_buffer),
            "::",
            stringify!(allocated)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<re_pattern_buffer>())).used as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(re_pattern_buffer),
            "::",
            stringify!(used)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<re_pattern_buffer>())).charset_unibyte as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(re_pattern_buffer),
            "::",
            stringify!(charset_unibyte)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<re_pattern_buffer>())).fastmap as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(re_pattern_buffer),
            "::",
            stringify!(fastmap)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<re_pattern_buffer>())).translate as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(re_pattern_buffer),
            "::",
            stringify!(translate)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<re_pattern_buffer>())).re_nsub as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(re_pattern_buffer),
            "::",
            stringify!(re_nsub)
        )
    );
}
impl Default for re_pattern_buffer {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
impl re_pattern_buffer {
    #[inline]
    pub fn can_be_null(&self) -> bool_bf {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_can_be_null(&mut self, val: bool_bf) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn regs_allocated(&self) -> ::libc::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 2u8) as u32) }
    }
    #[inline]
    pub fn set_regs_allocated(&mut self, val: ::libc::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn fastmap_accurate(&self) -> bool_bf {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_fastmap_accurate(&mut self, val: bool_bf) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn used_syntax(&self) -> bool_bf {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_used_syntax(&mut self, val: bool_bf) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn multibyte(&self) -> bool_bf {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(5usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_multibyte(&mut self, val: bool_bf) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(5usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn target_multibyte(&self) -> bool_bf {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(6usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_target_multibyte(&mut self, val: bool_bf) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(6usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        can_be_null: bool_bf,
        regs_allocated: ::libc::c_uint,
        fastmap_accurate: bool_bf,
        used_syntax: bool_bf,
        multibyte: bool_bf,
        target_multibyte: bool_bf,
    ) -> __BindgenBitfieldUnit<[u8; 1usize], u8> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize], u8> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let can_be_null: u8 = unsafe { ::std::mem::transmute(can_be_null) };
            can_be_null as u64
        });
        __bindgen_bitfield_unit.set(1usize, 2u8, {
            let regs_allocated: u32 = unsafe { ::std::mem::transmute(regs_allocated) };
            regs_allocated as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let fastmap_accurate: u8 = unsafe { ::std::mem::transmute(fastmap_accurate) };
            fastmap_accurate as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let used_syntax: u8 = unsafe { ::std::mem::transmute(used_syntax) };
            used_syntax as u64
        });
        __bindgen_bitfield_unit.set(5usize, 1u8, {
            let multibyte: u8 = unsafe { ::std::mem::transmute(multibyte) };
            multibyte as u64
        });
        __bindgen_bitfield_unit.set(6usize, 1u8, {
            let target_multibyte: u8 = unsafe { ::std::mem::transmute(target_multibyte) };
            target_multibyte as u64
        });
        __bindgen_bitfield_unit
    }
}
extern "C" {
    pub fn rpl_re_compile_pattern(
        pattern: *const ::libc::c_char,
        length: isize,
        posix_backtracking: bool,
        whitespace_regexp: *const ::libc::c_char,
        buffer: *mut re_pattern_buffer,
    ) -> *const ::libc::c_char;
}
extern "C" {
    pub fn rpl_re_search(
        buffer: *mut re_pattern_buffer,
        string: *const ::libc::c_char,
        length: isize,
        start: isize,
        range: isize,
        regs: *mut re_registers,
    ) -> isize;
}
extern "C" {
    pub fn rpl_re_search_2(
        buffer: *mut re_pattern_buffer,
        string1: *const ::libc::c_char,
        length1: isize,
        string2: *const ::libc::c_char,
        length2: isize,
        start: isize,
        range: isize,
        regs: *mut re_registers,
        stop: isize,
    ) -> isize;
}
extern "C" {
    pub fn rpl_re_match_2(
        buffer: *mut re_pattern_buffer,
        string1: *const ::libc::c_char,
        length1: isize,
        string2: *const ::libc::c_char,
        length2: isize,
        start: isize,
        regs: *mut re_registers,
        stop: isize,
    ) -> isize;
}
extern "C" {
    pub fn rpl_re_set_registers(
        buffer: *mut re_pattern_buffer,
        regs: *mut re_registers,
        num_regs: isize,
        starts: *mut isize,
        ends: *mut isize,
    );
}
pub mod re_wctype_t {
    pub type Type = u32;
    pub const RECC_ERROR: Type = 0;
    pub const RECC_ALNUM: Type = 1;
    pub const RECC_ALPHA: Type = 2;
    pub const RECC_WORD: Type = 3;
    pub const RECC_GRAPH: Type = 4;
    pub const RECC_PRINT: Type = 5;
    pub const RECC_LOWER: Type = 6;
    pub const RECC_UPPER: Type = 7;
    pub const RECC_PUNCT: Type = 8;
    pub const RECC_CNTRL: Type = 9;
    pub const RECC_DIGIT: Type = 10;
    pub const RECC_XDIGIT: Type = 11;
    pub const RECC_BLANK: Type = 12;
    pub const RECC_SPACE: Type = 13;
    pub const RECC_MULTIBYTE: Type = 14;
    pub const RECC_NONASCII: Type = 15;
    pub const RECC_ASCII: Type = 16;
    pub const RECC_UNIBYTE: Type = 17;
}
extern "C" {
    pub fn re_iswctype(ch: ::libc::c_int, cc: re_wctype_t::Type) -> bool;
}
extern "C" {
    pub fn re_wctype_parse(strp: *mut *const ::libc::c_uchar, limit: isize) -> re_wctype_t::Type;
}
pub type u_char = __u_char;
pub type u_short = __u_short;
pub type u_int = __u_int;
pub type u_long = __u_long;
pub type quad_t = __quad_t;
pub type u_quad_t = __u_quad_t;
pub type fsid_t = __fsid_t;
pub type loff_t = __loff_t;
pub type ino_t = __ino_t;
pub type ino64_t = __ino64_t;
pub type dev_t = __dev_t;
pub type gid_t = __gid_t;
pub type mode_t = __mode_t;
pub type nlink_t = __nlink_t;
pub type uid_t = __uid_t;
pub type off_t = __off_t;
pub type off64_t = __off64_t;
pub type pid_t = __pid_t;
pub type id_t = __id_t;
pub type daddr_t = __daddr_t;
pub type caddr_t = __caddr_t;
pub type key_t = __key_t;
pub type clock_t = __clock_t;
pub type clockid_t = __clockid_t;
pub type time_t = __time_t;
pub type timer_t = __timer_t;
pub type useconds_t = __useconds_t;
pub type suseconds_t = __suseconds_t;
pub type ulong = ::libc::c_ulong;
pub type ushort = ::libc::c_ushort;
pub type uint = ::libc::c_uint;
pub type u_int8_t = __uint8_t;
pub type u_int16_t = __uint16_t;
pub type u_int32_t = __uint32_t;
pub type u_int64_t = __uint64_t;
pub type register_t = ::libc::c_long;
pub type sigset_t = __sigset_t;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct timeval {
    pub tv_sec: __time_t,
    pub tv_usec: __suseconds_t,
}
#[test]
fn bindgen_test_layout_timeval() {
    assert_eq!(
        ::std::mem::size_of::<timeval>(),
        16usize,
        concat!("Size of: ", stringify!(timeval))
    );
    assert_eq!(
        ::std::mem::align_of::<timeval>(),
        8usize,
        concat!("Alignment of ", stringify!(timeval))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<timeval>())).tv_sec as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(timeval),
            "::",
            stringify!(tv_sec)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<timeval>())).tv_usec as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(timeval),
            "::",
            stringify!(tv_usec)
        )
    );
}
pub type __fd_mask = ::libc::c_long;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct fd_set {
    pub fds_bits: [__fd_mask; 16usize],
}
#[test]
fn bindgen_test_layout_fd_set() {
    assert_eq!(
        ::std::mem::size_of::<fd_set>(),
        128usize,
        concat!("Size of: ", stringify!(fd_set))
    );
    assert_eq!(
        ::std::mem::align_of::<fd_set>(),
        8usize,
        concat!("Alignment of ", stringify!(fd_set))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fd_set>())).fds_bits as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fd_set),
            "::",
            stringify!(fds_bits)
        )
    );
}
pub type fd_mask = __fd_mask;
extern "C" {
    pub fn select(
        __nfds: ::libc::c_int,
        __readfds: *mut fd_set,
        __writefds: *mut fd_set,
        __exceptfds: *mut fd_set,
        __timeout: *mut timeval,
    ) -> ::libc::c_int;
}
extern "C" {
    pub fn pselect(
        __nfds: ::libc::c_int,
        __readfds: *mut fd_set,
        __writefds: *mut fd_set,
        __exceptfds: *mut fd_set,
        __timeout: *const timespec,
        __sigmask: *const __sigset_t,
    ) -> ::libc::c_int;
}
pub type blksize_t = __blksize_t;
pub type blkcnt_t = __blkcnt_t;
pub type fsblkcnt_t = __fsblkcnt_t;
pub type fsfilcnt_t = __fsfilcnt_t;
pub type blkcnt64_t = __blkcnt64_t;
pub type fsblkcnt64_t = __fsblkcnt64_t;
pub type fsfilcnt64_t = __fsfilcnt64_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_internal_list {
    pub __prev: *mut __pthread_internal_list,
    pub __next: *mut __pthread_internal_list,
}
#[test]
fn bindgen_test_layout___pthread_internal_list() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_internal_list>(),
        16usize,
        concat!("Size of: ", stringify!(__pthread_internal_list))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_internal_list>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_internal_list))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_internal_list>())).__prev as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_internal_list),
            "::",
            stringify!(__prev)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_internal_list>())).__next as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_internal_list),
            "::",
            stringify!(__next)
        )
    );
}
impl Default for __pthread_internal_list {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
pub type __pthread_list_t = __pthread_internal_list;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_internal_slist {
    pub __next: *mut __pthread_internal_slist,
}
#[test]
fn bindgen_test_layout___pthread_internal_slist() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_internal_slist>(),
        8usize,
        concat!("Size of: ", stringify!(__pthread_internal_slist))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_internal_slist>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_internal_slist))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_internal_slist>())).__next as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_internal_slist),
            "::",
            stringify!(__next)
        )
    );
}
impl Default for __pthread_internal_slist {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
pub type __pthread_slist_t = __pthread_internal_slist;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_mutex_s {
    pub __lock: ::libc::c_int,
    pub __count: ::libc::c_uint,
    pub __owner: ::libc::c_int,
    pub __nusers: ::libc::c_uint,
    pub __kind: ::libc::c_int,
    pub __spins: ::libc::c_short,
    pub __elision: ::libc::c_short,
    pub __list: __pthread_list_t,
}
#[test]
fn bindgen_test_layout___pthread_mutex_s() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_mutex_s>(),
        40usize,
        concat!("Size of: ", stringify!(__pthread_mutex_s))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_mutex_s>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_mutex_s))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_mutex_s>())).__lock as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__lock)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_mutex_s>())).__count as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__count)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_mutex_s>())).__owner as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__owner)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_mutex_s>())).__nusers as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__nusers)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_mutex_s>())).__kind as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__kind)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_mutex_s>())).__spins as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__spins)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_mutex_s>())).__elision as *const _ as usize },
        22usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__elision)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_mutex_s>())).__list as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__list)
        )
    );
}
impl Default for __pthread_mutex_s {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct __pthread_rwlock_arch_t {
    pub __readers: ::libc::c_uint,
    pub __writers: ::libc::c_uint,
    pub __wrphase_futex: ::libc::c_uint,
    pub __writers_futex: ::libc::c_uint,
    pub __pad3: ::libc::c_uint,
    pub __pad4: ::libc::c_uint,
    pub __cur_writer: ::libc::c_int,
    pub __shared: ::libc::c_int,
    pub __rwelision: ::libc::c_schar,
    pub __pad1: [::libc::c_uchar; 7usize],
    pub __pad2: ::libc::c_ulong,
    pub __flags: ::libc::c_uint,
}
#[test]
fn bindgen_test_layout___pthread_rwlock_arch_t() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_rwlock_arch_t>(),
        56usize,
        concat!("Size of: ", stringify!(__pthread_rwlock_arch_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_rwlock_arch_t>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_rwlock_arch_t))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__readers as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__readers)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__writers as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__writers)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__wrphase_futex as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__wrphase_futex)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__writers_futex as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__writers_futex)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__pad3 as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__pad3)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__pad4 as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__pad4)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__cur_writer as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__cur_writer)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__shared as *const _ as usize
        },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__shared)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__rwelision as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__rwelision)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__pad1 as *const _ as usize },
        33usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__pad1)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__pad2 as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__pad2)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__flags as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__flags)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __pthread_cond_s {
    pub __bindgen_anon_1: __pthread_cond_s__bindgen_ty_1,
    pub __bindgen_anon_2: __pthread_cond_s__bindgen_ty_2,
    pub __g_refs: [::libc::c_uint; 2usize],
    pub __g_size: [::libc::c_uint; 2usize],
    pub __g1_orig_size: ::libc::c_uint,
    pub __wrefs: ::libc::c_uint,
    pub __g_signals: [::libc::c_uint; 2usize],
}
#[repr(C)]
#[repr(align(8))]
#[derive(Copy, Clone)]
pub union __pthread_cond_s__bindgen_ty_1 {
    pub __wseq: ::libc::c_ulonglong,
    pub __wseq32: __pthread_cond_s__bindgen_ty_1__bindgen_ty_1,
    _bindgen_union_align: u64,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct __pthread_cond_s__bindgen_ty_1__bindgen_ty_1 {
    pub __low: ::libc::c_uint,
    pub __high: ::libc::c_uint,
}
#[test]
fn bindgen_test_layout___pthread_cond_s__bindgen_ty_1__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_cond_s__bindgen_ty_1__bindgen_ty_1>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(__pthread_cond_s__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_cond_s__bindgen_ty_1__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(__pthread_cond_s__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_cond_s__bindgen_ty_1__bindgen_ty_1>())).__low
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(__low)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_cond_s__bindgen_ty_1__bindgen_ty_1>())).__high
                as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(__high)
        )
    );
}
#[test]
fn bindgen_test_layout___pthread_cond_s__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_cond_s__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(__pthread_cond_s__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_cond_s__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_cond_s__bindgen_ty_1))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_cond_s__bindgen_ty_1>())).__wseq as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_1),
            "::",
            stringify!(__wseq)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_cond_s__bindgen_ty_1>())).__wseq32 as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_1),
            "::",
            stringify!(__wseq32)
        )
    );
}
impl Default for __pthread_cond_s__bindgen_ty_1 {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[repr(C)]
#[repr(align(8))]
#[derive(Copy, Clone)]
pub union __pthread_cond_s__bindgen_ty_2 {
    pub __g1_start: ::libc::c_ulonglong,
    pub __g1_start32: __pthread_cond_s__bindgen_ty_2__bindgen_ty_1,
    _bindgen_union_align: u64,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct __pthread_cond_s__bindgen_ty_2__bindgen_ty_1 {
    pub __low: ::libc::c_uint,
    pub __high: ::libc::c_uint,
}
#[test]
fn bindgen_test_layout___pthread_cond_s__bindgen_ty_2__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_cond_s__bindgen_ty_2__bindgen_ty_1>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(__pthread_cond_s__bindgen_ty_2__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_cond_s__bindgen_ty_2__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(__pthread_cond_s__bindgen_ty_2__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_cond_s__bindgen_ty_2__bindgen_ty_1>())).__low
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_2__bindgen_ty_1),
            "::",
            stringify!(__low)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_cond_s__bindgen_ty_2__bindgen_ty_1>())).__high
                as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_2__bindgen_ty_1),
            "::",
            stringify!(__high)
        )
    );
}
#[test]
fn bindgen_test_layout___pthread_cond_s__bindgen_ty_2() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_cond_s__bindgen_ty_2>(),
        8usize,
        concat!("Size of: ", stringify!(__pthread_cond_s__bindgen_ty_2))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_cond_s__bindgen_ty_2>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_cond_s__bindgen_ty_2))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_cond_s__bindgen_ty_2>())).__g1_start as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_2),
            "::",
            stringify!(__g1_start)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_cond_s__bindgen_ty_2>())).__g1_start32 as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_2),
            "::",
            stringify!(__g1_start32)
        )
    );
}
impl Default for __pthread_cond_s__bindgen_ty_2 {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[test]
fn bindgen_test_layout___pthread_cond_s() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_cond_s>(),
        48usize,
        concat!("Size of: ", stringify!(__pthread_cond_s))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_cond_s>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_cond_s))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_cond_s>())).__g_refs as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__g_refs)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_cond_s>())).__g_size as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__g_size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_cond_s>())).__g1_orig_size as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__g1_orig_size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_cond_s>())).__wrefs as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__wrefs)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_cond_s>())).__g_signals as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__g_signals)
        )
    );
}
impl Default for __pthread_cond_s {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
pub type __tss_t = ::libc::c_uint;
pub type __thrd_t = ::libc::c_ulong;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct __once_flag {
    pub __data: ::libc::c_int,
}
#[test]
fn bindgen_test_layout___once_flag() {
    assert_eq!(
        ::std::mem::size_of::<__once_flag>(),
        4usize,
        concat!("Size of: ", stringify!(__once_flag))
    );
    assert_eq!(
        ::std::mem::align_of::<__once_flag>(),
        4usize,
        concat!("Alignment of ", stringify!(__once_flag))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__once_flag>())).__data as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__once_flag),
            "::",
            stringify!(__data)
        )
    );
}
pub type pthread_t = ::libc::c_ulong;
#[repr(C)]
#[repr(align(4))]
#[derive(Copy, Clone)]
pub union pthread_mutexattr_t {
    pub __size: [::libc::c_char; 4usize],
    pub __align: ::libc::c_int,
    _bindgen_union_align: u32,
}
#[test]
fn bindgen_test_layout_pthread_mutexattr_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_mutexattr_t>(),
        4usize,
        concat!("Size of: ", stringify!(pthread_mutexattr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_mutexattr_t>(),
        4usize,
        concat!("Alignment of ", stringify!(pthread_mutexattr_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_mutexattr_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutexattr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_mutexattr_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutexattr_t),
            "::",
            stringify!(__align)
        )
    );
}
impl Default for pthread_mutexattr_t {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[repr(C)]
#[repr(align(4))]
#[derive(Copy, Clone)]
pub union pthread_condattr_t {
    pub __size: [::libc::c_char; 4usize],
    pub __align: ::libc::c_int,
    _bindgen_union_align: u32,
}
#[test]
fn bindgen_test_layout_pthread_condattr_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_condattr_t>(),
        4usize,
        concat!("Size of: ", stringify!(pthread_condattr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_condattr_t>(),
        4usize,
        concat!("Alignment of ", stringify!(pthread_condattr_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_condattr_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_condattr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_condattr_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_condattr_t),
            "::",
            stringify!(__align)
        )
    );
}
impl Default for pthread_condattr_t {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
pub type pthread_key_t = ::libc::c_uint;
pub type pthread_once_t = ::libc::c_int;
#[repr(C)]
#[repr(align(8))]
#[derive(Copy, Clone)]
pub union pthread_attr_t {
    pub __size: [::libc::c_char; 56usize],
    pub __align: ::libc::c_long,
    _bindgen_union_align: [u64; 7usize],
}
#[test]
fn bindgen_test_layout_pthread_attr_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_attr_t>(),
        56usize,
        concat!("Size of: ", stringify!(pthread_attr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_attr_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_attr_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_attr_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_attr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_attr_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_attr_t),
            "::",
            stringify!(__align)
        )
    );
}
impl Default for pthread_attr_t {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[repr(C)]
#[repr(align(8))]
#[derive(Copy, Clone)]
pub union pthread_mutex_t {
    pub __data: __pthread_mutex_s,
    pub __size: [::libc::c_char; 40usize],
    pub __align: ::libc::c_long,
    _bindgen_union_align: [u64; 5usize],
}
#[test]
fn bindgen_test_layout_pthread_mutex_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_mutex_t>(),
        40usize,
        concat!("Size of: ", stringify!(pthread_mutex_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_mutex_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_mutex_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_mutex_t>())).__data as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutex_t),
            "::",
            stringify!(__data)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_mutex_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutex_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_mutex_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutex_t),
            "::",
            stringify!(__align)
        )
    );
}
impl Default for pthread_mutex_t {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[repr(C)]
#[repr(align(8))]
#[derive(Copy, Clone)]
pub union pthread_cond_t {
    pub __data: __pthread_cond_s,
    pub __size: [::libc::c_char; 48usize],
    pub __align: ::libc::c_longlong,
    _bindgen_union_align: [u64; 6usize],
}
#[test]
fn bindgen_test_layout_pthread_cond_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_cond_t>(),
        48usize,
        concat!("Size of: ", stringify!(pthread_cond_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_cond_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_cond_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_cond_t>())).__data as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_cond_t),
            "::",
            stringify!(__data)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_cond_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_cond_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_cond_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_cond_t),
            "::",
            stringify!(__align)
        )
    );
}
impl Default for pthread_cond_t {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[repr(C)]
#[repr(align(8))]
#[derive(Copy, Clone)]
pub union pthread_rwlock_t {
    pub __data: __pthread_rwlock_arch_t,
    pub __size: [::libc::c_char; 56usize],
    pub __align: ::libc::c_long,
    _bindgen_union_align: [u64; 7usize],
}
#[test]
fn bindgen_test_layout_pthread_rwlock_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_rwlock_t>(),
        56usize,
        concat!("Size of: ", stringify!(pthread_rwlock_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_rwlock_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_rwlock_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_rwlock_t>())).__data as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlock_t),
            "::",
            stringify!(__data)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_rwlock_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlock_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_rwlock_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlock_t),
            "::",
            stringify!(__align)
        )
    );
}
impl Default for pthread_rwlock_t {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[repr(C)]
#[repr(align(8))]
#[derive(Copy, Clone)]
pub union pthread_rwlockattr_t {
    pub __size: [::libc::c_char; 8usize],
    pub __align: ::libc::c_long,
    _bindgen_union_align: u64,
}
#[test]
fn bindgen_test_layout_pthread_rwlockattr_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_rwlockattr_t>(),
        8usize,
        concat!("Size of: ", stringify!(pthread_rwlockattr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_rwlockattr_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_rwlockattr_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_rwlockattr_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlockattr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_rwlockattr_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlockattr_t),
            "::",
            stringify!(__align)
        )
    );
}
impl Default for pthread_rwlockattr_t {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
pub type pthread_spinlock_t = ::libc::c_int;
#[repr(C)]
#[repr(align(8))]
#[derive(Copy, Clone)]
pub union pthread_barrier_t {
    pub __size: [::libc::c_char; 32usize],
    pub __align: ::libc::c_long,
    _bindgen_union_align: [u64; 4usize],
}
#[test]
fn bindgen_test_layout_pthread_barrier_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_barrier_t>(),
        32usize,
        concat!("Size of: ", stringify!(pthread_barrier_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_barrier_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_barrier_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_barrier_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_barrier_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_barrier_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_barrier_t),
            "::",
            stringify!(__align)
        )
    );
}
impl Default for pthread_barrier_t {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[repr(C)]
#[repr(align(4))]
#[derive(Copy, Clone)]
pub union pthread_barrierattr_t {
    pub __size: [::libc::c_char; 4usize],
    pub __align: ::libc::c_int,
    _bindgen_union_align: u32,
}
#[test]
fn bindgen_test_layout_pthread_barrierattr_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_barrierattr_t>(),
        4usize,
        concat!("Size of: ", stringify!(pthread_barrierattr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_barrierattr_t>(),
        4usize,
        concat!("Alignment of ", stringify!(pthread_barrierattr_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_barrierattr_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_barrierattr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_barrierattr_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_barrierattr_t),
            "::",
            stringify!(__align)
        )
    );
}
impl Default for pthread_barrierattr_t {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
extern "C" {
    pub fn fd_CLR(fd: ::libc::c_int, set: *mut fd_set);
}
extern "C" {
    pub fn fd_ISSET(fd: ::libc::c_int, set: *mut fd_set) -> bool;
}
extern "C" {
    pub fn fd_SET(fd: ::libc::c_int, set: *mut fd_set);
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct sched_param {
    pub sched_priority: ::libc::c_int,
}
#[test]
fn bindgen_test_layout_sched_param() {
    assert_eq!(
        ::std::mem::size_of::<sched_param>(),
        4usize,
        concat!("Size of: ", stringify!(sched_param))
    );
    assert_eq!(
        ::std::mem::align_of::<sched_param>(),
        4usize,
        concat!("Alignment of ", stringify!(sched_param))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<sched_param>())).sched_priority as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sched_param),
            "::",
            stringify!(sched_priority)
        )
    );
}
extern "C" {
    pub fn clone(
        __fn: ::std::option::Option<
            unsafe extern "C" fn(__arg: *mut ::libc::c_void) -> ::libc::c_int,
        >,
        __child_stack: *mut ::libc::c_void,
        __flags: ::libc::c_int,
        __arg: *mut ::libc::c_void,
        ...
    ) -> ::libc::c_int;
}
extern "C" {
    pub fn unshare(__flags: ::libc::c_int) -> ::libc::c_int;
}
extern "C" {
    pub fn sched_getcpu() -> ::libc::c_int;
}
extern "C" {
    pub fn getcpu(arg1: *mut ::libc::c_uint, arg2: *mut ::libc::c_uint) -> ::libc::c_int;
}
extern "C" {
    pub fn setns(__fd: ::libc::c_int, __nstype: ::libc::c_int) -> ::libc::c_int;
}
pub type __cpu_mask = ::libc::c_ulong;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct cpu_set_t {
    pub __bits: [__cpu_mask; 16usize],
}
#[test]
fn bindgen_test_layout_cpu_set_t() {
    assert_eq!(
        ::std::mem::size_of::<cpu_set_t>(),
        128usize,
        concat!("Size of: ", stringify!(cpu_set_t))
    );
    assert_eq!(
        ::std::mem::align_of::<cpu_set_t>(),
        8usize,
        concat!("Alignment of ", stringify!(cpu_set_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cpu_set_t>())).__bits as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cpu_set_t),
            "::",
            stringify!(__bits)
        )
    );
}
extern "C" {
    pub fn __sched_cpucount(__setsize: usize, __setp: *const cpu_set_t) -> ::libc::c_int;
}
extern "C" {
    pub fn __sched_cpualloc(__count: usize) -> *mut cpu_set_t;
}
extern "C" {
    pub fn __sched_cpufree(__set: *mut cpu_set_t);
}
extern "C" {
    pub fn sched_setparam(__pid: __pid_t, __param: *const sched_param) -> ::libc::c_int;
}
extern "C" {
    pub fn sched_getparam(__pid: __pid_t, __param: *mut sched_param) -> ::libc::c_int;
}
extern "C" {
    pub fn sched_setscheduler(
        __pid: __pid_t,
        __policy: ::libc::c_int,
        __param: *const sched_param,
    ) -> ::libc::c_int;
}
extern "C" {
    pub fn sched_getscheduler(__pid: __pid_t) -> ::libc::c_int;
}
extern "C" {
    pub fn sched_yield() -> ::libc::c_int;
}
extern "C" {
    pub fn sched_get_priority_max(__algorithm: ::libc::c_int) -> ::libc::c_int;
}
extern "C" {
    pub fn sched_get_priority_min(__algorithm: ::libc::c_int) -> ::libc::c_int;
}
extern "C" {
    pub fn sched_rr_get_interval(__pid: __pid_t, __t: *mut timespec) -> ::libc::c_int;
}
extern "C" {
    pub fn sched_setaffinity(
        __pid: __pid_t,
        __cpusetsize: usize,
        __cpuset: *const cpu_set_t,
    ) -> ::libc::c_int;
}
extern "C" {
    pub fn sched_getaffinity(
        __pid: __pid_t,
        __cpusetsize: usize,
        __cpuset: *mut cpu_set_t,
    ) -> ::libc::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm {
    pub tm_sec: ::libc::c_int,
    pub tm_min: ::libc::c_int,
    pub tm_hour: ::libc::c_int,
    pub tm_mday: ::libc::c_int,
    pub tm_mon: ::libc::c_int,
    pub tm_year: ::libc::c_int,
    pub tm_wday: ::libc::c_int,
    pub tm_yday: ::libc::c_int,
    pub tm_isdst: ::libc::c_int,
    pub tm_gmtoff: ::libc::c_long,
    pub tm_zone: *const ::libc::c_char,
}
#[test]
fn bindgen_test_layout_tm() {
    assert_eq!(
        ::std::mem::size_of::<tm>(),
        56usize,
        concat!("Size of: ", stringify!(tm))
    );
    assert_eq!(
        ::std::mem::align_of::<tm>(),
        8usize,
        concat!("Alignment of ", stringify!(tm))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm>())).tm_sec as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_sec)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm>())).tm_min as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_min)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm>())).tm_hour as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_hour)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm>())).tm_mday as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_mday)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm>())).tm_mon as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_mon)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm>())).tm_year as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_year)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm>())).tm_wday as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_wday)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm>())).tm_yday as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_yday)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm>())).tm_isdst as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_isdst)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm>())).tm_gmtoff as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_gmtoff)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm>())).tm_zone as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_zone)
        )
    );
}
impl Default for tm {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[repr(C)]
pub struct itimerspec {
    pub it_interval: timespec,
    pub it_value: timespec,
}
#[test]
fn bindgen_test_layout_itimerspec() {
    assert_eq!(
        ::std::mem::size_of::<itimerspec>(),
        32usize,
        concat!("Size of: ", stringify!(itimerspec))
    );
    assert_eq!(
        ::std::mem::align_of::<itimerspec>(),
        8usize,
        concat!("Alignment of ", stringify!(itimerspec))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<itimerspec>())).it_interval as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(itimerspec),
            "::",
            stringify!(it_interval)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<itimerspec>())).it_value as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(itimerspec),
            "::",
            stringify!(it_value)
        )
    );
}
impl Default for itimerspec {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
extern "C" {
    pub fn clock() -> clock_t;
}
extern "C" {
    pub fn time(__timer: *mut time_t) -> time_t;
}
extern "C" {
    pub fn difftime(__time1: time_t, __time0: time_t) -> f64;
}
extern "C" {
    pub fn mktime(__tp: *mut tm) -> time_t;
}
extern "C" {
    pub fn strftime(
        __s: *mut ::libc::c_char,
        __maxsize: usize,
        __format: *const ::libc::c_char,
        __tp: *const tm,
    ) -> usize;
}
extern "C" {
    pub fn strptime(
        __s: *const ::libc::c_char,
        __fmt: *const ::libc::c_char,
        __tp: *mut tm,
    ) -> *mut ::libc::c_char;
}
extern "C" {
    pub fn strftime_l(
        __s: *mut ::libc::c_char,
        __maxsize: usize,
        __format: *const ::libc::c_char,
        __tp: *const tm,
        __loc: locale_t,
    ) -> usize;
}
extern "C" {
    pub fn strptime_l(
        __s: *const ::libc::c_char,
        __fmt: *const ::libc::c_char,
        __tp: *mut tm,
        __loc: locale_t,
    ) -> *mut ::libc::c_char;
}
extern "C" {
    pub fn gmtime(__timer: *const time_t) -> *mut tm;
}
extern "C" {
    pub fn localtime(__timer: *const time_t) -> *mut tm;
}
extern "C" {
    pub fn gmtime_r(__timer: *const time_t, __tp: *mut tm) -> *mut tm;
}
extern "C" {
    pub fn localtime_r(__timer: *const time_t, __tp: *mut tm) -> *mut tm;
}
extern "C" {
    pub fn asctime(__tp: *const tm) -> *mut ::libc::c_char;
}
extern "C" {
    pub fn ctime(__timer: *const time_t) -> *mut ::libc::c_char;
}
extern "C" {
    pub fn asctime_r(__tp: *const tm, __buf: *mut ::libc::c_char) -> *mut ::libc::c_char;
}
extern "C" {
    pub fn ctime_r(__timer: *const time_t, __buf: *mut ::libc::c_char) -> *mut ::libc::c_char;
}
extern "C" {
    #[link_name = "\u{1}__tzname"]
    pub static mut __tzname: [*mut ::libc::c_char; 2usize];
}
extern "C" {
    #[link_name = "\u{1}__daylight"]
    pub static mut __daylight: ::libc::c_int;
}
extern "C" {
    #[link_name = "\u{1}__timezone"]
    pub static mut __timezone: ::libc::c_long;
}
extern "C" {
    #[link_name = "\u{1}tzname"]
    pub static mut tzname: [*mut ::libc::c_char; 2usize];
}
extern "C" {
    pub fn tzset();
}
extern "C" {
    #[link_name = "\u{1}daylight"]
    pub static mut daylight: ::libc::c_int;
}
extern "C" {
    #[link_name = "\u{1}timezone"]
    pub static mut timezone: ::libc::c_long;
}
extern "C" {
    pub fn timegm(__tp: *mut tm) -> time_t;
}
extern "C" {
    pub fn timelocal(__tp: *mut tm) -> time_t;
}
extern "C" {
    pub fn dysize(__year: ::libc::c_int) -> ::libc::c_int;
}
extern "C" {
    pub fn nanosleep(
        __requested_time: *const timespec,
        __remaining: *mut timespec,
    ) -> ::libc::c_int;
}
extern "C" {
    pub fn clock_getres(__clock_id: clockid_t, __res: *mut timespec) -> ::libc::c_int;
}
extern "C" {
    pub fn clock_gettime(__clock_id: clockid_t, __tp: *mut timespec) -> ::libc::c_int;
}
extern "C" {
    pub fn clock_settime(__clock_id: clockid_t, __tp: *const timespec) -> ::libc::c_int;
}
extern "C" {
    pub fn clock_nanosleep(
        __clock_id: clockid_t,
        __flags: ::libc::c_int,
        __req: *const timespec,
        __rem: *mut timespec,
    ) -> ::libc::c_int;
}
extern "C" {
    pub fn clock_getcpuclockid(__pid: pid_t, __clock_id: *mut clockid_t) -> ::libc::c_int;
}
extern "C" {
    pub fn timer_create(
        __clock_id: clockid_t,
        __evp: *mut sigevent,
        __timerid: *mut timer_t,
    ) -> ::libc::c_int;
}
extern "C" {
    pub fn timer_delete(__timerid: timer_t) -> ::libc::c_int;
}
extern "C" {
    pub fn timer_settime(
        __timerid: timer_t,
        __flags: ::libc::c_int,
        __value: *const itimerspec,
        __ovalue: *mut itimerspec,
    ) -> ::libc::c_int;
}
extern "C" {
    pub fn timer_gettime(__timerid: timer_t, __value: *mut itimerspec) -> ::libc::c_int;
}
extern "C" {
    pub fn timer_getoverrun(__timerid: timer_t) -> ::libc::c_int;
}
extern "C" {
    pub fn timespec_get(__ts: *mut timespec, __base: ::libc::c_int) -> ::libc::c_int;
}
extern "C" {
    #[link_name = "\u{1}getdate_err"]
    pub static mut getdate_err: ::libc::c_int;
}
extern "C" {
    pub fn getdate(__string: *const ::libc::c_char) -> *mut tm;
}
extern "C" {
    pub fn getdate_r(__string: *const ::libc::c_char, __resbufp: *mut tm) -> ::libc::c_int;
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Default, Copy, Clone)]
pub struct __time_t_must_be_integral {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize], u8>,
    pub __bindgen_padding_0: [u8; 3usize],
}
#[test]
fn bindgen_test_layout___time_t_must_be_integral() {
    assert_eq!(
        ::std::mem::size_of::<__time_t_must_be_integral>(),
        4usize,
        concat!("Size of: ", stringify!(__time_t_must_be_integral))
    );
    assert_eq!(
        ::std::mem::align_of::<__time_t_must_be_integral>(),
        4usize,
        concat!("Alignment of ", stringify!(__time_t_must_be_integral))
    );
}
impl __time_t_must_be_integral {
    #[inline]
    pub fn __floating_time_t_unsupported(&self) -> ::libc::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set___floating_time_t_unsupported(&mut self, val: ::libc::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        __floating_time_t_unsupported: ::libc::c_uint,
    ) -> __BindgenBitfieldUnit<[u8; 1usize], u8> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize], u8> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let __floating_time_t_unsupported: u32 =
                unsafe { ::std::mem::transmute(__floating_time_t_unsupported) };
            __floating_time_t_unsupported as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_zone {
    _unused: [u8; 0],
}
pub type timezone_t = *mut tm_zone;
extern "C" {
    pub fn tzalloc(__name: *const ::libc::c_char) -> timezone_t;
}
extern "C" {
    pub fn tzfree(__tz: timezone_t);
}
extern "C" {
    pub fn localtime_rz(__tz: timezone_t, __timer: *const time_t, __result: *mut tm) -> *mut tm;
}
extern "C" {
    pub fn mktime_z(__tz: timezone_t, __result: *mut tm) -> time_t;
}
pub mod _bindgen_ty_7 {
    pub type Type = u32;
    pub const PTHREAD_CREATE_JOINABLE: Type = 0;
    pub const PTHREAD_CREATE_DETACHED: Type = 1;
}
pub mod _bindgen_ty_8 {
    pub type Type = u32;
    pub const PTHREAD_MUTEX_TIMED_NP: Type = 0;
    pub const PTHREAD_MUTEX_RECURSIVE_NP: Type = 1;
    pub const PTHREAD_MUTEX_ERRORCHECK_NP: Type = 2;
    pub const PTHREAD_MUTEX_ADAPTIVE_NP: Type = 3;
    pub const PTHREAD_MUTEX_NORMAL: Type = 0;
    pub const PTHREAD_MUTEX_RECURSIVE: Type = 1;
    pub const PTHREAD_MUTEX_ERRORCHECK: Type = 2;
    pub const PTHREAD_MUTEX_DEFAULT: Type = 0;
    pub const PTHREAD_MUTEX_FAST_NP: Type = 0;
}
pub mod _bindgen_ty_9 {
    pub type Type = u32;
    pub const PTHREAD_MUTEX_STALLED: Type = 0;
    pub const PTHREAD_MUTEX_STALLED_NP: Type = 0;
    pub const PTHREAD_MUTEX_ROBUST: Type = 1;
    pub const PTHREAD_MUTEX_ROBUST_NP: Type = 1;
}
pub mod _bindgen_ty_10 {
    pub type Type = u32;
    pub const PTHREAD_PRIO_NONE: Type = 0;
    pub const PTHREAD_PRIO_INHERIT: Type = 1;
    pub const PTHREAD_PRIO_PROTECT: Type = 2;
}
pub mod _bindgen_ty_11 {
    pub type Type = u32;
    pub const PTHREAD_RWLOCK_PREFER_READER_NP: Type = 0;
    pub const PTHREAD_RWLOCK_PREFER_WRITER_NP: Type = 1;
    pub const PTHREAD_RWLOCK_PREFER_WRITER_NONRECURSIVE_NP: Type = 2;
    pub const PTHREAD_RWLOCK_DEFAULT_NP: Type = 0;
}
pub mod _bindgen_ty_12 {
    pub type Type = u32;
    pub const PTHREAD_INHERIT_SCHED: Type = 0;
    pub const PTHREAD_EXPLICIT_SCHED: Type = 1;
}
pub mod _bindgen_ty_13 {
    pub type Type = u32;
    pub const PTHREAD_SCOPE_SYSTEM: Type = 0;
    pub const PTHREAD_SCOPE_PROCESS: Type = 1;
}
pub mod _bindgen_ty_14 {
    pub type Type = u32;
    pub const PTHREAD_PROCESS_PRIVATE: Type = 0;
    pub const PTHREAD_PROCESS_SHARED: Type = 1;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _pthread_cleanup_buffer {
    pub __routine: ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::libc::c_void)>,
    pub __arg: *mut ::libc::c_void,
    pub __canceltype: ::libc::c_int,
    pub __prev: *mut _pthread_cleanup_buffer,
}
#[test]
fn bindgen_test_layout__pthread_cleanup_buffer() {
    assert_eq!(
        ::std::mem::size_of::<_pthread_cleanup_buffer>(),
        32usize,
        concat!("Size of: ", stringify!(_pthread_cleanup_buffer))
    );
    assert_eq!(
        ::std::mem::align_of::<_pthread_cleanup_buffer>(),
        8usize,
        concat!("Alignment of ", stringify!(_pthread_cleanup_buffer))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_pthread_cleanup_buffer>())).__routine as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_pthread_cleanup_buffer),
            "::",
            stringify!(__routine)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_pthread_cleanup_buffer>())).__arg as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_pthread_cleanup_buffer),
            "::",
            stringify!(__arg)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_pthread_cleanup_buffer>())).__canceltype as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_pthread_cleanup_buffer),
            "::",
            stringify!(__canceltype)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_pthread_cleanup_buffer>())).__prev as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_pthread_cleanup_buffer),
            "::",
            stringify!(__prev)
        )
    );
}
impl Default for _pthread_cleanup_buffer {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
pub mod _bindgen_ty_15 {
    pub type Type = u32;
    pub const PTHREAD_CANCEL_ENABLE: Type = 0;
    pub const PTHREAD_CANCEL_DISABLE: Type = 1;
}
pub mod _bindgen_ty_16 {
    pub type Type = u32;
    pub const PTHREAD_CANCEL_DEFERRED: Type = 0;
    pub const PTHREAD_CANCEL_ASYNCHRONOUS: Type = 1;
}
extern "C" {
    pub fn pthread_create(
        __newthread: *mut pthread_t,
        __attr: *const pthread_attr_t,
        __start_routine: ::std::option::Option<
            unsafe extern "C" fn(arg1: *mut ::libc::c_void) -> *mut ::libc::c_void,
        >,
        __arg: *mut ::libc::c_void,
    ) -> ::libc::c_int;
}
extern "C" {
    pub fn pthread_exit(__retval: *mut ::libc::c_void);
}
extern "C" {
    pub fn pthread_join(
        __th: pthread_t,
        __thread_return: *mut *mut ::libc::c_void,
    ) -> ::libc::c_int;
}
extern "C" {
    pub fn pthread_tryjoin_np(
        __th: pthread_t,
        __thread_return: *mut *mut ::libc::c_void,
    ) -> ::libc::c_int;
}
extern "C" {
    pub fn pthread_timedjoin_np(
        __th: pthread_t,
        __thread_return: *mut *mut ::libc::c_void,
        __abstime: *const timespec,
    ) -> ::libc::c_int;
}
extern "C" {
    pub fn pthread_clockjoin_np(
        __th: pthread_t,
        __thread_return: *mut *mut ::libc::c_void,
        __clockid: clockid_t,
        __abstime: *const timespec,
    ) -> ::libc::c_int;
}
extern "C" {
    pub fn pthread_detach(__th: pthread_t) -> ::libc::c_int;
}
extern "C" {
    pub fn pthread_self() -> pthread_t;
}
extern "C" {
    pub fn pthread_equal(__thread1: pthread_t, __thread2: pthread_t) -> ::libc::c_int;
}
extern "C" {
    pub fn pthread_attr_init(__attr: *mut pthread_attr_t) -> ::libc::c_int;
}
extern "C" {
    pub fn pthread_attr_destroy(__attr: *mut pthread_attr_t) -> ::libc::c_int;
}
extern "C" {
    pub fn pthread_attr_getdetachstate(
        __attr: *const pthread_attr_t,
        __detachstate: *mut ::libc::c_int,
    ) -> ::libc::c_int;
}
extern "C" {
    pub fn pthread_attr_setdetachstate(
        __attr: *mut pthread_attr_t,
        __detachstate: ::libc::c_int,
    ) -> ::libc::c_int;
}
extern "C" {
    pub fn pthread_attr_getguardsize(
        __attr: *const pthread_attr_t,
        __guardsize: *mut usize,
    ) -> ::libc::c_int;
}
extern "C" {
    pub fn pthread_attr_setguardsize(
        __attr: *mut pthread_attr_t,
        __guardsize: usize,
    ) -> ::libc::c_int;
}
extern "C" {
    pub fn pthread_attr_getschedparam(
        __attr: *const pthread_attr_t,
        __param: *mut sched_param,
    ) -> ::libc::c_int;
}
extern "C" {
    pub fn pthread_attr_setschedparam(
        __attr: *mut pthread_attr_t,
        __param: *const sched_param,
    ) -> ::libc::c_int;
}
extern "C" {
    pub fn pthread_attr_getschedpolicy(
        __attr: *const pthread_attr_t,
        __policy: *mut ::libc::c_int,
    ) -> ::libc::c_int;
}
extern "C" {
    pub fn pthread_attr_setschedpolicy(
        __attr: *mut pthread_attr_t,
        __policy: ::libc::c_int,
    ) -> ::libc::c_int;
}
extern "C" {
    pub fn pthread_attr_getinheritsched(
        __attr: *const pthread_attr_t,
        __inherit: *mut ::libc::c_int,
    ) -> ::libc::c_int;
}
extern "C" {
    pub fn pthread_attr_setinheritsched(
        __attr: *mut pthread_attr_t,
        __inherit: ::libc::c_int,
    ) -> ::libc::c_int;
}
extern "C" {
    pub fn pthread_attr_getscope(
        __attr: *const pthread_attr_t,
        __scope: *mut ::libc::c_int,
    ) -> ::libc::c_int;
}
extern "C" {
    pub fn pthread_attr_setscope(
        __attr: *mut pthread_attr_t,
        __scope: ::libc::c_int,
    ) -> ::libc::c_int;
}
extern "C" {
    pub fn pthread_attr_getstackaddr(
        __attr: *const pthread_attr_t,
        __stackaddr: *mut *mut ::libc::c_void,
    ) -> ::libc::c_int;
}
extern "C" {
    pub fn pthread_attr_setstackaddr(
        __attr: *mut pthread_attr_t,
        __stackaddr: *mut ::libc::c_void,
    ) -> ::libc::c_int;
}
extern "C" {
    pub fn pthread_attr_getstacksize(
        __attr: *const pthread_attr_t,
        __stacksize: *mut usize,
    ) -> ::libc::c_int;
}
extern "C" {
    pub fn pthread_attr_setstacksize(
        __attr: *mut pthread_attr_t,
        __stacksize: usize,
    ) -> ::libc::c_int;
}
extern "C" {
    pub fn pthread_attr_getstack(
        __attr: *const pthread_attr_t,
        __stackaddr: *mut *mut ::libc::c_void,
        __stacksize: *mut usize,
    ) -> ::libc::c_int;
}
extern "C" {
    pub fn pthread_attr_setstack(
        __attr: *mut pthread_attr_t,
        __stackaddr: *mut ::libc::c_void,
        __stacksize: usize,
    ) -> ::libc::c_int;
}
extern "C" {
    pub fn pthread_attr_setaffinity_np(
        __attr: *mut pthread_attr_t,
        __cpusetsize: usize,
        __cpuset: *const cpu_set_t,
    ) -> ::libc::c_int;
}
extern "C" {
    pub fn pthread_attr_getaffinity_np(
        __attr: *const pthread_attr_t,
        __cpusetsize: usize,
        __cpuset: *mut cpu_set_t,
    ) -> ::libc::c_int;
}
extern "C" {
    pub fn pthread_getattr_default_np(__attr: *mut pthread_attr_t) -> ::libc::c_int;
}
extern "C" {
    pub fn pthread_attr_setsigmask_np(
        __attr: *mut pthread_attr_t,
        sigmask: *const __sigset_t,
    ) -> ::libc::c_int;
}
extern "C" {
    pub fn pthread_attr_getsigmask_np(
        __attr: *const pthread_attr_t,
        sigmask: *mut __sigset_t,
    ) -> ::libc::c_int;
}
extern "C" {
    pub fn pthread_setattr_default_np(__attr: *const pthread_attr_t) -> ::libc::c_int;
}
extern "C" {
    pub fn pthread_getattr_np(__th: pthread_t, __attr: *mut pthread_attr_t) -> ::libc::c_int;
}
extern "C" {
    pub fn pthread_setschedparam(
        __target_thread: pthread_t,
        __policy: ::libc::c_int,
        __param: *const sched_param,
    ) -> ::libc::c_int;
}
extern "C" {
    pub fn pthread_getschedparam(
        __target_thread: pthread_t,
        __policy: *mut ::libc::c_int,
        __param: *mut sched_param,
    ) -> ::libc::c_int;
}
extern "C" {
    pub fn pthread_setschedprio(__target_thread: pthread_t, __prio: ::libc::c_int)
        -> ::libc::c_int;
}
extern "C" {
    pub fn pthread_getname_np(
        __target_thread: pthread_t,
        __buf: *mut ::libc::c_char,
        __buflen: usize,
    ) -> ::libc::c_int;
}
extern "C" {
    pub fn pthread_setname_np(
        __target_thread: pthread_t,
        __name: *const ::libc::c_char,
    ) -> ::libc::c_int;
}
extern "C" {
    pub fn pthread_getconcurrency() -> ::libc::c_int;
}
extern "C" {
    pub fn pthread_setconcurrency(__level: ::libc::c_int) -> ::libc::c_int;
}
extern "C" {
    pub fn pthread_yield() -> ::libc::c_int;
}
extern "C" {
    pub fn pthread_setaffinity_np(
        __th: pthread_t,
        __cpusetsize: usize,
        __cpuset: *const cpu_set_t,
    ) -> ::libc::c_int;
}
extern "C" {
    pub fn pthread_getaffinity_np(
        __th: pthread_t,
        __cpusetsize: usize,
        __cpuset: *mut cpu_set_t,
    ) -> ::libc::c_int;
}
extern "C" {
    pub fn pthread_once(
        __once_control: *mut pthread_once_t,
        __init_routine: ::std::option::Option<unsafe extern "C" fn()>,
    ) -> ::libc::c_int;
}
extern "C" {
    pub fn pthread_setcancelstate(
        __state: ::libc::c_int,
        __oldstate: *mut ::libc::c_int,
    ) -> ::libc::c_int;
}
extern "C" {
    pub fn pthread_setcanceltype(
        __type: ::libc::c_int,
        __oldtype: *mut ::libc::c_int,
    ) -> ::libc::c_int;
}
extern "C" {
    pub fn pthread_cancel(__th: pthread_t) -> ::libc::c_int;
}
extern "C" {
    pub fn pthread_testcancel();
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct __cancel_jmp_buf_tag {
    pub __cancel_jmp_buf: __jmp_buf,
    pub __mask_was_saved: ::libc::c_int,
}
#[test]
fn bindgen_test_layout___cancel_jmp_buf_tag() {
    assert_eq!(
        ::std::mem::size_of::<__cancel_jmp_buf_tag>(),
        72usize,
        concat!("Size of: ", stringify!(__cancel_jmp_buf_tag))
    );
    assert_eq!(
        ::std::mem::align_of::<__cancel_jmp_buf_tag>(),
        8usize,
        concat!("Alignment of ", stringify!(__cancel_jmp_buf_tag))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__cancel_jmp_buf_tag>())).__cancel_jmp_buf as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__cancel_jmp_buf_tag),
            "::",
            stringify!(__cancel_jmp_buf)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__cancel_jmp_buf_tag>())).__mask_was_saved as *const _ as usize
        },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(__cancel_jmp_buf_tag),
            "::",
            stringify!(__mask_was_saved)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_unwind_buf_t {
    pub __cancel_jmp_buf: [__cancel_jmp_buf_tag; 1usize],
    pub __pad: [*mut ::libc::c_void; 4usize],
}
#[test]
fn bindgen_test_layout___pthread_unwind_buf_t() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_unwind_buf_t>(),
        104usize,
        concat!("Size of: ", stringify!(__pthread_unwind_buf_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_unwind_buf_t>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_unwind_buf_t))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_unwind_buf_t>())).__cancel_jmp_buf as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_unwind_buf_t),
            "::",
            stringify!(__cancel_jmp_buf)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_unwind_buf_t>())).__pad as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_unwind_buf_t),
            "::",
            stringify!(__pad)
        )
    );
}
impl Default for __pthread_unwind_buf_t {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_cleanup_frame {
    pub __cancel_routine: ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::libc::c_void)>,
    pub __cancel_arg: *mut ::libc::c_void,
    pub __do_it: ::libc::c_int,
    pub __cancel_type: ::libc::c_int,
}
#[test]
fn bindgen_test_layout___pthread_cleanup_frame() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_cleanup_frame>(),
        24usize,
        concat!("Size of: ", stringify!(__pthread_cleanup_frame))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_cleanup_frame>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_cleanup_frame))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_cleanup_frame>())).__cancel_routine as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cleanup_frame),
            "::",
            stringify!(__cancel_routine)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_cleanup_frame>())).__cancel_arg as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cleanup_frame),
            "::",
            stringify!(__cancel_arg)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_cleanup_frame>())).__do_it as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cleanup_frame),
            "::",
            stringify!(__do_it)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_cleanup_frame>())).__cancel_type as *const _ as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cleanup_frame),
            "::",
            stringify!(__cancel_type)
        )
    );
}
impl Default for __pthread_cleanup_frame {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
extern "C" {
    pub fn __pthread_register_cancel(__buf: *mut __pthread_unwind_buf_t);
}
extern "C" {
    pub fn __pthread_unregister_cancel(__buf: *mut __pthread_unwind_buf_t);
}
extern "C" {
    pub fn __pthread_register_cancel_defer(__buf: *mut __pthread_unwind_buf_t);
}
extern "C" {
    pub fn __pthread_unregister_cancel_restore(__buf: *mut __pthread_unwind_buf_t);
}
extern "C" {
    pub fn __pthread_unwind_next(__buf: *mut __pthread_unwind_buf_t);
}
extern "C" {
    pub fn pthread_mutex_init(
        __mutex: *mut pthread_mutex_t,
        __mutexattr: *const pthread_mutexattr_t,
    ) -> ::libc::c_int;
}
extern "C" {
    pub fn pthread_mutex_destroy(__mutex: *mut pthread_mutex_t) -> ::libc::c_int;
}
extern "C" {
    pub fn pthread_mutex_trylock(__mutex: *mut pthread_mutex_t) -> ::libc::c_int;
}
extern "C" {
    pub fn pthread_mutex_lock(__mutex: *mut pthread_mutex_t) -> ::libc::c_int;
}
extern "C" {
    pub fn pthread_mutex_timedlock(
        __mutex: *mut pthread_mutex_t,
        __abstime: *const timespec,
    ) -> ::libc::c_int;
}
extern "C" {
    pub fn pthread_mutex_clocklock(
        __mutex: *mut pthread_mutex_t,
        __clockid: clockid_t,
        __abstime: *const timespec,
    ) -> ::libc::c_int;
}
extern "C" {
    pub fn pthread_mutex_unlock(__mutex: *mut pthread_mutex_t) -> ::libc::c_int;
}
extern "C" {
    pub fn pthread_mutex_getprioceiling(
        __mutex: *const pthread_mutex_t,
        __prioceiling: *mut ::libc::c_int,
    ) -> ::libc::c_int;
}
extern "C" {
    pub fn pthread_mutex_setprioceiling(
        __mutex: *mut pthread_mutex_t,
        __prioceiling: ::libc::c_int,
